[{"_template":"html","content":"<h1>Terms of Use</h1><h4>Last updated June 05, 2018</h4><p>Thank you for visiting our website located at <a title=' The Marker Waterfront Resort' href='https://www.themarkerkeywest.com/'>www.themarkerkeywest.com</a> (the &ldquo;Site&rdquo;) and for your interest in <strong> The Marker Waterfront Resort</strong> (sometimes hereinafter referred to as &ldquo;Hotel&rdquo;, &ldquo;we&rdquo;, &ldquo;us&rdquo;, or &ldquo;our&rdquo;). As a condition of using this Site we require that you agree to each of the terms and conditions of use and notices stated below (the &ldquo;Terms&rdquo;). If you do not agree to these Terms without modification, please discontinue use of this Site.</p><p>The content and information displayed on this Site (&ldquo;Hotel Information&rdquo;) is the property of Hotel and/or other parties. You agree that downloading, reproducing, or transmitting Hotel Information is strictly prohibited (except to the extent conducted for non-commercial individual use).</p><p>This Site may contain or reference trademarks, patents, copyrighted materials, trade secrets, technologies, products, processes or other proprietary rights of Hotel and/or other parties. You are not granted any license to use or right in any such trademarks, patents, copyrighted materials, trade secrets, technologies, products, processes and other proprietary rights of Hotel and/or other parties.</p><p>You agree that you will not (i) use any device, software or other instrumentality to interfere with the proper working of this Site (including causing any unreasonable or disproportionate burden on our infrastructure); (ii) use any robot, spider, other automatic device, or manual process to monitor or copy our Site or the content contained herein without the prior written consent of an authorized Hotel representative; (iii) remove any trademarks, copyright notices, or any other notice contained in any Hotel Information; (iv) reproduce, download, distribute, license, sell, rent, lease, adapt, create derivative works based upon, or publicly display the Hotel Information; (v) frame, mirror, or otherwise incorporate any portion of the Site or Hotel Information into another website or location; (vi) disassemble, decompile or reverse engineer any of the Hotel Information; (vii) attempt to hack any portion of the Site, or to defeat or overcome any encryption technology or security measures implemented by us; (viii) violate any applicable law; (ix) provide any inaccurate, misleading, or fraudulent information through or in connection to the Site; or (x) post or submit any unlawful, infringing, offensive, threatening, harassing, libelous, defamatory, obscene or otherwise objectionable material via the Site.</p><p>ALL HOTEL INFORMATION AND ANY OTHER INFORMATION IS PROVIDED &ldquo;AS IS&rdquo; WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT. HOTEL MAKES NO WARRANTY, REPRESENTATION OR CONDITION WITH RESPECT TO THE SITE, INCLUDING BUT NOT LIMITED TO, THE QUALITY, EFFECTIVENESS, REPUTATION AND OTHER CHARACTERISTICS OF THE SITE. ANY CONTENT DOWNLOADED FROM OR OTHERWISE ACCESSED THROUGH THE SITE IS ACCESSED AT YOUR OWN RISK, AND YOU SHALL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY OR PERSON, INCLUDING, BUT NOT LIMITED TO, YOUR COMPUTER SYSTEM AND ANY DEVICE YOU USE TO ACCESS OUR SITE, OR ANY OTHER LOSS THAT RESULTS FROM ACCESSING SUCH CONTENT. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED FROM OR THROUGH THE SITE OR WILL CREATE ANY WARRANTY NOT EXPRESSLY MADE HEREIN. HOTEL MAKES NO WARRANTY, REPRESENTATION OR CONDITION THAT: (1) THIS SITE OR HOTEL INFORMATION WILL MEET YOUR REQUIREMENTS; (2) YOUR USE OF THIS SITE WILL BE UNINTERRUPTED, TIMELY, SECURE OR ERROR-FREE; (3) THE RESULTS THAT MAY BE OBTAINED FROM USE OF THIS SITE WILL BE ACCURATE OR RELIABLE; OR (4) ANY ERRORS IN ON THIS SITE WILL BE CORRECTED. NEITHER US NOR ANY OF OUR SUBSIDIARIES, AFFILIATES, AGENTS, REPRESENTATIVES OR LICENSORS (THE &ldquo;HOTEL PARTIES&rdquo;) SHALL BE LIABLE TO YOU OR ANYONE ELSE FOR ANY LOSS OR INJURY OR ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL, PUNITIVE OR SIMILAR DAMAGES ARISING OUT OF YOUR ACCESS OR USE OF, OR YOUR INABILITY TO ACCESS OR USE, THIS SITE OR ANY MATERIALS, OPINIONS OR RECOMMENDATIONS OF THIRD PARTIES ON THIS SITE. THIS LIMITATION APPLIES WHETHER THE ALLEGED LIABILITY IS BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR ANY OTHER BASIS, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. IN JURISDICTIONS THAT DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, OUR LIABILITY IN SUCH JURISDICTIONS SHALL BE LIMITED TO THE EXTENT PERMITTED BY LAW. YOU HEREBY RELEASE AND WAIVE ANY AND ALL CLAIMS AGAINST US AND THE HOTEL PARTIES ARISING DIRECTLY OR INDIRECTLY OUT OF YOUR USE OF THIS SITE. If you are a California resident, you hereby waive California Civil Code Section 1542, which states, &ldquo;A general release does not extend to claims which the creditor does not know or suspect to exist in his favor at the time of executing the release, which, if known by him must have materially affected his settlement with the debtor.&rdquo;</p><p>Subject to our privacy policy as relates to personally identifiable information, with respect to all communications you make to Hotel regarding Hotel Information, including but not limited to feedback, questions, comments, suggestions and the like that you provide on the Site, e-mail, text messages, telephone or social media: (a) you shall have no right of confidentiality in your communications and Hotel shall have no obligation to protect your communications from disclosure; (b) Hotel shall be free to reproduce, use, disclose and distribute your communications to others without limitation; and (c) Hotel shall be free to use any ideas, concepts, know-how, content or techniques contained in your communications for any purpose whatsoever, including but not limited to the development, production and marketing of products and services that incorporate such information.</p><p>Hotel reserves the right to make changes, corrections, cancellations and/or improvements to Hotel Information and to the products and programs described in such information, at any time without notice, including after confirmation of a transaction.</p><p>Hotel is a company domiciled in the United States and is prohibited from providing services to certain &ldquo;prohibited persons&rdquo; that are government officials or residents of certain embargoed countries, or other individuals whose names are published on lists maintained by United States government agencies.</p><p>This Site may contain links to external websites not controlled by us. We are not responsible for the terms of use or privacy practices and data collection policies for third party sites. You should consult the terms of use and privacy policies of those sites for details. In addition, because Hotel has no control over such websites and resources, you acknowledge and agree that Hotel is not responsible for the availability of such external websites or resources, and does not endorse and is not responsible or liable for any content, advertising, products, or other materials on or available from such websites or resources.</p><p>Any disputes arising out of or related to the Site shall be governed by and construed and enforced in accordance with the laws of the State of New York.</p><p>We may update these Terms from time to time. By using the Site, you (on behalf of yourself and your organization, if applicable) are expressly agreeing to the terms and conditions of the then-posted version of these Terms.</p><p>If you would like to view the privacy practices that govern how we process personally identifiable information (PII) about you that you submit on this Site, please review our Privacy Policy <a title='Privacy Policy' href='https://www.themarkerkeywest.com/privacy/'>www.themarkerkeywest.com/privacy</a>. By using our Site, you consent to your PII being processed as set out in our Privacy Policy.</p><p>These Terms and any agreements or policies referenced herein constitute the entire agreement between the parties regarding the subject matter thereof and supersede any prior or contemporaneous agreements with regards to such subject matter. A party&rsquo;s failure to exercise or enforce any right or provision of these Terms shall not operate as a waiver of such right or provision. If you have any questions regarding these Terms, please contact us at <a title='Contact Us' href='mailto:info@markerkeywest.com'>info@markerkeywest.com</a>.</p>","rendered_height":500}]
