[
  {
    "content": "<div tabindex=\"0\">\n<p dir=\"ltr\">The Marker Waterfront Resort (sometimes hereinafter referred to as &ldquo;Hotel&rdquo;, &ldquo;we&rdquo;, &ldquo;us&rdquo;, or &ldquo;our&rdquo;) is dedicated to providing exceptional service to guests of all abilities. We strive to provide online content that provides an excellent user experience for visitors of all abilities, using any type of assistive technology to access the website.</p>\n<p dir=\"ltr\">We base our website accessibility standards on the Web Content Accessibility Guidelines 2.1, level A + AA success criteria. In addition, we actively work to maintain, assess and improve the usability and accessibility of our website through training of our personnel, engagement of experts and regular testing of our digital accessibility.&nbsp;</p>\n<h3 dir=\"ltr\">We welcome feedback &nbsp;</h3>\n<p dir=\"ltr\">If you experience any difficulty accessing or navigating our websites or have any accessibility-related questions or comments, we are listening. Please contact us at (305) 501-5193 or <a href=\"mailto:reservations@southernmostresorts.com\">reservations@southernmostresorts.com </a>with a description of the issue you encountered and your contact information. Your experience matters to us.</p>\n<p dir=\"ltr\">The Marker Waterfront Resort website may contain material from social media sites such as Facebook and Youtube, which are used to share additional content about our property, facilities and services. These third-party sites may have accessibility issues that are beyond our control. We invite you to review further public accessibility information directly from<a href=\"https://www.facebook.com/help/accessibility\"> Facebook</a>,<a href=\"https://support.google.com/youtube/answer/189278?hl=en\"> Youtube</a>,<a href=\"https://twitter.com/twittera11y?lang=en\"> Twitter</a> and<a href=\"https://help.instagram.com/1178723545597542\"> Instagram</a>.</p>\n<h3 dir=\"ltr\">Accessible Features and Amenities</h3>\n<p dir=\"ltr\">The Hotel is ADA compliant in accordance with the construction statutes of the ADA (Department of Justice ADA Title III Regulation 28 CFR Part 36, 1991). We welcome guests of all abilities. Our property descriptions aim to allow any visitor to make an informed decision on whether the hotel is an appropriate choice for their needs.</p>\n<h3 dir=\"ltr\">Property features</h3>\n<ul>\n<li dir=\"ltr\">Accessible public entrance.</li>\n<li dir=\"ltr\">The registration desk is 48&rdquo; high. Guests who are unable to access the registration desk will receive personal assistance. &nbsp;</li>\n<li dir=\"ltr\"></li>\n<li dir=\"ltr\">Accessible route from the public entrance to the registration area and accessible rooms.</li>\n<li dir=\"ltr\">Accessible elevator. Accessible route to the elevator from the public entrance, registration desk and rooms.</li>\n<li dir=\"ltr\">Accessible emergency exit. &nbsp;</li>\n<li dir=\"ltr\"></li>\n<li dir=\"ltr\">Accessible public restroom.</li>\n<li dir=\"ltr\">Accessible concierge desk.</li>\n<li dir=\"ltr\">Accessible route from parking area to the main entrance.</li>\n<li dir=\"ltr\">Accessible parking, valet only.&nbsp;</li>\n<li dir=\"ltr\">TTY for guest use.</li>\n<li dir=\"ltr\">Visual (strobe light) alarms.</li>\n<li dir=\"ltr\">Guest room televisions have closed captioning or closed captioning decoders are provided.</li>\n<li>Accessible food and beverage outlets: Cero Bodega</li>\n<li dir=\"ltr\"></li>\n<li dir=\"ltr\">Accessible route to Cero Bodega from the public entrance and accessible rooms.&nbsp;</li>\n<li dir=\"ltr\">Accessible business center. Accessible route to business center from the public entrance and accessible rooms.</li>\n<li dir=\"ltr\">Accessible meeting and event facility, and accessible route to meeting and event facility from the public entrance and accessible rooms. &nbsp;</li>\n<li dir=\"ltr\">Accessible exercise facilities, and accessible route to exercise facilities from the public entrance and accessible rooms.</li>\n<li dir=\"ltr\">Accessible pool, and accessible route to pool from the public entrance and accessible rooms.</li>\n<li dir=\"ltr\">Service animals are welcome at The Marker Waterfront Resort.&nbsp;</li>\n</ul>\n<h3>Accessible guest rooms</h3>\n<h4 dir=\"ltr\">Marker Classic Balcony King ADA w/Roll-in Shower</h4>\n<ul>\n<li dir=\"ltr\">1 king bed</li>\n<li dir=\"ltr\">Roll-in shower</li>\n<li dir=\"ltr\">Doorbell, low peephole, ADA-compliant phone, TTY available, fire strobe&nbsp;</li>\n</ul>\n<h4 dir=\"ltr\">Marker Classic Balcony King Hearing Accessible</h4>\n<ul>\n<li dir=\"ltr\">1 king bed</li>\n<li dir=\"ltr\">ADA tub</li>\n<li dir=\"ltr\">Doorbell, low peephole, ADA-compliant phone, TTY available, fire strobe</li>\n</ul>\n<h4 dir=\"ltr\" style=\"box-sizing: border-box; font-family: 'Muli Light'; font-weight: 500; line-height: 1.1; color: #006e8b; margin-top: 0px; margin-bottom: 25px; font-size: 20px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: #ffffff; text-decoration-style: initial; text-decoration-color: initial;\">Marker Classic&nbsp;One Bedroom Suite Accessible</h4>\n<ul>\n<li dir=\"ltr\">1 king bed</li>\n<li dir=\"ltr\">ADA tub</li>\n<li dir=\"ltr\">Doorbell, low peephole, ADA-compliant phone, TTY available, fire strobe</li>\n</ul>\n<p>&nbsp;</p>\n<p dir=\"ltr\">Accessible route from public entrance and registration area to accessible rooms.</p>\n<p dir=\"ltr\">From a digitally accessible website to complete descriptions of all onsite amenities and features, we wish to provide a positive experience from start to finish. Please note that this accessibility statement applies to all content on The Marker Waterfront Resort website. The hotel is not responsible for any third-party content on the website.</p>\n</div>",
    "_template": "text"
  }
]