[
  {
    "_template": "html",
    "content": "<h1 class=\"h1\" tabindex=\"0\">About The Marker Waterfront Resort</h1>\n<p class=\"h1\">Key West</p>\n<div tabindex=\"0\">\n<p><strong>When did The Marker Waterfront Resort Key West open?</strong><br />The resort opened in mid December 2014 as Key West's newest <a title=\"Luxurious Marker Key West\" href=\"https://www.themarkerkeywest.com/\">luxury waterfront resort</a> in 20 years.</p>\n<p><strong>How many stars is The Marker?</strong><br />The Marker is a 4-star property featuring 96 luxuriously appointed <a title=\"Key West accommodations\" href=\"https://www.themarkerkeywest.com/accommodations/\">guestrooms</a> offering private balconies and soaking tubs. The perfect place to unwind in style, The Marker features lush tropical grounds and three stunning and secluded pools. The resort boasts a dedicated \"Conchierge\" that serves as a personal resource and insider guide for guests to experience the best Key West has to offer.</p>\n<p><strong>Where are you located in Key West?</strong><br />Ideally located on the edge of the <a title=\"The Marker location\" href=\"https://www.themarkerkeywest.com/location/\">Key West Historic Seaport</a>, The Marker is in the heart of Old Town Key West, only a few blocks from Duval Street. The resort is just steps away from the famous Mallory Square and the world's most beautiful sunsets over the Gulf of Mexico. To view our illustrative map detailing our location, please <a href=\"https://www.themarkerkeywest.com/location/\">click here</a>.</p>\n<p><strong>Do you have a pool?</strong><br />The Marker features three sparkling pools surrounded by lush tropical landscaping. Poolside cocktail service is available allowing guests to sun, swim and sip throughout the day and into the evening. For more privacy, retreat to our dedicated adult only pool.</p>\n<p><strong>Do you have a fitness center?</strong><br />Yes. Stay active and feel revitalized by enjoying our onsite fitness center. Filled with state-of-the-art equipment in a sleek, luxury minded space, it's the perfect place to melt away your stress with a cardio workout or pump up your energy with strength training. Clear your mind, care for your body.</p>\n<p><strong>Do you have on-site parking?</strong><br />Yes. The Marker offers parking for guests, a rare amenity in bustling Old Town Key West. Onsite covered parking is available for a fee of $35/night plus tax. Parking is valet only and one vehicle will be allowed to park on property per guest room reservation.</p>\n<p><strong>Is there a Resort Amenities Fee?</strong><br />Yes. The resort amenities fee is $45 plus applicable taxes.</p>\n<p><strong>Are pets welcomed at The Marker?</strong><br />Unfortunately, at this time The Marker cannot accommodate pets.</p>\n<p><strong>Is there an age restriction to check-in?</strong><br />Yes. Guests must be 21 years of age to check-in.</p>\n</div>"
  }
]