{
  "map": {
    "url": "",
    "alt": "",
    "caption": "",
    "description": ""
  },
  "title": "8 Instagram-Worthy Spots in Key West ",
  "url_friendly_name": "8-instagram-worthy-spots-in-key-west",
  "date": "2020-01-06T00:00:00.000Z",
  "blogimage": {
    "name": "the-marker-key-west-eco-marker-blog-pic1",
    "content_type": "image/jpeg",
    "date_added": "2019-05-22-032838",
    "url_thumb": "//res.cloudinary.com/traveltripperweb/image/upload/c_fill,g_faces,h_140,w_140/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "url_xsmall": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_300,w_300/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "url_small": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_768,w_768/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "url_medium": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_992,w_992/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "url_large": "//res.cloudinary.com/traveltripperweb/image/upload/c_fit,h_1200,w_1200/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "url_xlarge": "//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_1920,w_1920/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "width": 1000,
    "height": 563,
    "format": "jpg",
    "url": "//res.cloudinary.com/traveltripperweb/image/upload/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "resource_type": "image",
    "size": 76346,
    "git_file_name": "_assets/image_data/the-marker-key-west-eco-marker-blog-pic1.jpg.json",
    "path": "//res.cloudinary.com/traveltripperweb/image/upload/v1558510118/tl5u9sh14nifzniiyert.jpg",
    "file_size": null,
    "alt": "the-marker-key-west-eco-marker-blog-pic1",
    "caption": "",
    "description": ""
  },
  "short_description": "We love scrolling through Instagram just as much as you do, and because of that, we’ve compiled a list of Instagram worthy locations in Key West, especially for you. Here is a list of eight Instagram-worthy travel-inspired hot spots just for you. ",
  "more_content": "<p>We love scrolling through Instagram just as much as you do, and because of that, we&rsquo;ve compiled a list of Instagram worthy locations in Key West, especially for you. Here is a list of eight Instagram-worthy travel-inspired hot spots just for you.</p>\n<h2>At Sunset</h2>\n<p>&ldquo;A sunset is the sun&rsquo;s fiery kiss to the night.&rdquo; ― Crystal Woods</p>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350041/gmhqhp1pnkzexoh1misa.png\" alt=\"boat\" />@monica.little.shrines</p>\n<p>No matter where you watch the sunset, whether it be by land or sea, it&rsquo;s a must-see and do experience in Key West. Head over to <a href=\"https://www.mallorysquare.com/sunset-celebration/\" target=\"_blank\" rel=\"noopener noreferrer\">Mallory Square for Sunset Celebration</a> or you can set sail at sunset and enjoy the light show in paradise aboard one of our many sunset charters. Did you know taking a photo at the golden hour is actually one of the best times to get that wow photo? Seriously, one of the best times to take selfies and capture that awesome photo is right after sunrise and before the sunset.</p>\n<h2>At the Beach</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350049/kujae3blfogsyuawwfvj.png\" alt=\"woman at beach\" />@dora_alexplorer</p>\n<p>Whether you are hanging out in a hammock, dipping your toes in the sand or pool, there&rsquo;s no better place to capture the perfect island getaway selfie than here in Key West. Vacy mode is on and all you need is your phone or camera to capture what&rsquo;s important - making memories and memorable moments in paradise. The photo above taken at Fort Zachary Taylor Beach captures the Key West island vibe.</p>\n<h2>Southernmost Point</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350062/gkq8c8pjgqw8jiqxic2v.png\" alt=\"southernmost point\" />@luca_pirro_quasiofficial</p>\n<p>In case you did not know, Key West is known as the southernmost city in the continental United States. The Southernmost Buoy, located at the southernmost point on the island, is where you&rsquo;ll capture this most popular and iconic photo ops. Be prepared to wait as you won&rsquo;t be the only one wanting to grab that photo that represents - I took a selfie at the Southernmost Point in the US. You&rsquo;ll find the Southernmost Point Buoy at the corner of South Street and Whitehead Street.</p>\n<h2>Top of the Lighthouse</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350067/yhdudlopu93zl1rsrmyo.png\" alt=\"woman at lighthouse\" />@elidalemusrodriguez</p>\n<p>To capture the island view from above as the backdrop of this insta-worthy photo, we suggest heading over to the Key West Lighthouse and Keepers Quarters. Visitors can walk up the 88 steps to the top of the light and explore the belongings, photographs, and words of the lighthouse Keepers and their families who lived a now obsolete, yet never forgotten, way of life.</p>\n<p>&ldquo;Climbing to the top of the lighthouse gives an excellent view of the entire island. In clear weather, you can see far out to sea....but not all the way to Cuba, LOL. There is a little museum to tour which gives a great history of the lighthouse and its keepers. They even have the GIGANTIC light in there. ~ Wmason43 on TripAdvisor</p>\n<p>Learn more about the <a href=\"https://www.kwahs.org/museums/lighthouse-keepers-quarters\" target=\"_blank\" rel=\"noopener noreferrer\">Key West Lighthouse and Keeper's Quarters Museum</a>.</p>\n<h2>Key West Greetings Mural</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350074/qgbnijddnoxeehuendph.png\" alt=\"key west greetings mural\" />@_shonalipatel</p>\n<p>One of the most insta-worthy locations for a photo in Key West is this colorful vintage mural and welcome message &ldquo;Greetings from Key West.&rdquo; On the other side of the mural is one of the best places to grab a cup of coffee and a sandwich as it&rsquo;s home to Cuban Coffee Queen. You don&rsquo;t have to go far to capture this photo because it&rsquo;s located steps from our waterfront resort at 284 Margaret Street.</p>\n<h2>Mile Marker Zero</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350079/o3rkbltfotimgh6lndo6.png\" alt=\"mile marker zero\" />@bobbelob1</p>\n<p>Even a sign has the popularity of a star. At the corner of Fleming and Whitehead Streets in Key West is where you&rsquo;ll find the Mile Marker Zero Sign. Wondering why this is so popular? This sign marks the end (or the beginning) of US 1, and the other sign is located in Fort Kent in Maine. It&rsquo;s one of the most famous mile markers of the Country. So when you visit, make sure to get a photo in front of this famous sign, it&rsquo;s proof you&rsquo;ve made it to the end of the road. If you&rsquo;re driving or walking by, you&rsquo;ll notice visitors getting this milestone photo op.</p>\n<h2>Next to Marilyn</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350085/qkek6hphaafretgnyv5z.png\" alt=\"young girl next to marilyn statue\" />@kenz4dance</p>\n<p>&ldquo;At least check out Marilyn if you are in the area. Even if you don't make it to the theater, at least make a detour and check out the Marilyn Monroe statue in her famous pose to get some fun Key West crazy pics. ~ Shawni_and_Buck TripAdvisor</p>\n<p><a href=\"https://www.tropiccinema.com/\" target=\"_blank\" rel=\"noopener noreferrer\">The Tropic Cinema</a> is a retro-style cinema with four theaters for mainstream and indie films, plus cultural events &amp; lectures. It&rsquo;s located 416 Eaton Street in Old Town, Key West.</p>\n<h2>Art Worthy at The Marker</h2>\n<p><img src=\"//res.cloudinary.com/traveltripperweb/image/upload/c_limit,h_2500,w_2500/v1578350092/ntipuegp5ohv4ougw8dq.png\" alt=\"art\" />  @irinavoronina</p>\n<p>Let art be the backdrop of your selfie at our Key West resort. Key West artist Adam Russell, from <a href=\"https://www.keywestpottery.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Key West Pottery</a>, has created a series of 7-foot tall sculptures &mdash; the Five Watchovers &mdash; that represent different elements of island history and culture, and stand tall and resilient over the Marker Waterfront Resort property. They greet our guests with totems of a pelican, historically a symbol of good fortune for weary, homecoming sailors.</p>\n<p>We know there are endless photo-worthy locations that can be found simply by getting lost in paradise. We are also sure you&rsquo;ll capture those moments along with the island vibe during your visit. Enjoy your stay and keep sharing those insta-worthy photos and vacation selfies with us. #lovethemarker</p>"
}