{"title":"12 Days of Key West: An Itinerary of Top Spots","categories":"Key West Events","url_friendly_name":"12-Days-of-Key-West","date":"Mon Dec 12 2016 00:00:00 GMT+0530 (India Standard Time)","tags":["Explorations","Key West Events"],"Posted_by":"Admin","short_description":"The holidays are here again and holiday cheer is ringing through the keys! Playing off of the holiday classic “The Twelve Days of Christmas,” we’ve come up with 12 days of local holiday things to do from finding gifts for friends & family to experiencing unique spots and events in the city.","more_content":"<p>The holidays are here again and holiday cheer is ringing through the keys! Playing off of the holiday classic &ldquo;The Twelve Days of Christmas,&rdquo; we&rsquo;ve come up with 12 days of local holiday things to do from finding gifts for friends &amp; family to experiencing unique spots and events in the city. After all, the holidays are a time to reflect on the past year and spend time with the ones you love. Whether you are looking for unique presents or simply fun events in Key West, we&rsquo;re sure that you&rsquo;ll find something on our list.</p>\n<p><strong>1)</strong> We&rsquo;re kicking off with a little inspiration from a partridge in a pear tree and helping the environment. In the spirit of the season of giving we&rsquo;re highlighting a local Key West volunteer organization, <a href=\"http://growinghopeinitiative.org/\" target=\"_blank\">Grimal Grove</a>, that works towards <a href=\"http://growinghopeinitiative.org/mission-and-vision\" target=\"_blank\">education, artistic development, community welfare, and environmental health</a> in the Florida Keys. We know that giving back to the community is one of the best gifts to give and encourage you to donate to organizations near to your heart.</p>\n<p><strong>2)</strong> Trade turtledoves for a stop at the <a href=\"http://www.keywestturtlemuseum.org/museum\" target=\"_blank\">Key West Turtle Museum</a>; only a 5-minute walk from <a href=\"http://www.themarkerkeywest.com/\">The Marker Resort</a>! The museum will open your eyes to some surprising facts, like how <a href=\"http://www.keywestturtlemuseum.org/museum\">archaeological evidence</a> showed that in years long past, Key West natives relied on turtles as a food source. Or, how <a href=\"http://www.keywestturtlemuseum.org/museum\" target=\"_blank\">in the 1900s</a> the turtle population drastically dropped from over fishing, leading to preservation and educational efforts to protect the turtles. After learning about the history of turtles, see them in person at the <a href=\"https://www.keywestaquarium.com/about-aquarium\" target=\"_blank\">Key West Aquarium</a>.</p>\n<p><strong>3)</strong> Experience every era of classic car (perfect for an <a href=\"https://www.instagram.com/themarkerresort/\" target=\"_blank\">Instagram</a>!) at the <a href=\"http://keywestinns.com/index.php/events/key-west-holiday-fest\" target=\"_blank\">Holiday Classic Car Show</a>. The event will take place at the Harbor Walk plaza where they will also be collecting toys to give to children at the <a href=\"http://www.domesticabuseshelter.org/\" target=\"_blank\">Monroe County Domestic Abuse Shelter</a>.&nbsp;</p>\n<p><strong>4)</strong> Experience the holiday favorite &ldquo;The Nutcracker&rdquo; with a Key West spin. In this version Clara encounters a Rooster-king, a Sea-Star fairy, and most scenes take place underwater leading to beautiful set and costumes options! It&rsquo;s truly a unique way to see &ldquo;<a href=\"https://keystix.ticketforce.com/eventperformances.asp?evt=927\" target=\"_blank\">The Nutcracker</a>&rdquo; for the whole family, running now through December 18th. &nbsp;</p>\n<p><strong>5)</strong> Find 5 golden rings and more at one of Key West&rsquo;s best jewelers: <a href=\"https://www.etsy.com/shop/GildedPeach\" target=\"_blank\">Gilded Lily</a>, <a href=\"http://www.localcolorkeywest.com/greene-street-location/\" target=\"_blank\">Local Color</a> or <a href=\"http://www.localcolorkeywest.com/commotion/\" target=\"_blank\">Commotion</a> offer a beautiful selection that sure to wow the one you love!&nbsp;</p>\n<p><strong>6)</strong> Experience the conch architecture and interesting interiors of <a href=\"http://keywestinns.com/index.php/events/key-west-holiday-fest\" target=\"_blank\">Key West's Historic Inns</a> on their <a href=\"http://keywestinns.com/index.php/events/key-west-holiday-fest\" target=\"_blank\">holiday tour series</a>! The inns are decked out in holiday decor and holiday treats are offered at each property, making for a festive time!</p>\n<p><strong>7)</strong> Tis the season to make like 7-swans-a-swimming and take a dip! We recommend either a beach day at <a href=\"http://www.fortzacharytaylor.com/\" target=\"_blank\">Fort Zachary Taylor</a> or sailing with <a href=\"https://www.facebook.com/events/1806443752931936/\" target=\"_blank\">Santa on Fury Water Adventures</a>. Jingle all the way to a nearby reef with <a href=\"https://www.furycat.com/\" target=\"_blank\">Fury</a> on a cruise filled with holiday music, treats, beer, wine, and of course, hot chocolate!&nbsp;</p>\n<p><strong>8)</strong> Take a break from the chaos of the holidays and have a romantic date night at one of Key West&rsquo;s best dessert spots. From <a href=\"http://www.keylimeshop.com/\" target=\"_blank\">Kermit&rsquo;s Key West Key Lime Shoppe</a> to <a href=\"http://www.betterthansexdesserts.com/\" target=\"_blank\">Better Than Sex</a>, you&rsquo;ll be sure to find a delicious treat!&nbsp;</p>\n<p><strong>9)</strong> You&rsquo;ll be sure to find at least &lsquo;9 ladies dancing&rsquo; at some of Key West&rsquo;s best places to cut a rug! If you&rsquo;re feeling a night of dancing night we recommend <a href=\"http://www.greenparrot.com/\" target=\"_blank\">Green Parrot Bar</a>&nbsp;or <a href=\"http://ricksbarkeywest.com/\" target=\"_blank\">Rick&rsquo;s Bar</a>, or if you&rsquo;re looking for something a little more laid back <a href=\"http://www.littleroomjazzclub.com/\" target=\"_blank\">The Little Jazz Room</a> is a great option. Plus, if you have a friend who loves&nbsp;</p>\n<p><strong>10)</strong> Join us for a poolside screening of Bad Santa on 12/8 with holiday drink specials and delicious food from <a href=\"http://www.themarkerkeywest.com/drinks-and-dining/cero-bodega/\" target=\"_blank\">The Marker&rsquo;s Cero Bodega</a>. During the evening Bad Santa will be making an appearance so you can find out if you&rsquo;ve been naughty or nice this year! &nbsp;&nbsp;</p>\n<p><strong>11)</strong> Catch the <a href=\"http://www.fla-keys.com/calendarofevents/?dac=1\" target=\"_blank\">Inaugural Holiday Concert &amp; Bazaar at Custom House Museum</a> featuring some of Key West&rsquo;s artists, musicians and creatives. If you are still looking for the perfect gift, this bazaar will offer hundreds of gift options, and we even hear Santa will be making an appearance to help you find the perfect gift for those on your list!</p>\n<p><strong>12)</strong> There may not be 12 drummers drumming, but the <a href=\"https://www.facebook.com/events/565183173673098/\" target=\"_blank\">holiday concert poolside</a> on December 22nd at The Marker is sure to get you in the spirit of the season! Gather your friends and family for an evening of shopping from local art and jewelry vendors with tunes by Rusty Lemmon!&nbsp;</p>","blogimage":{"url":"https://cdn.traveltripper.io/site-assets/202_388_1115/media/2016-12-15-023459/Marker12DaysBlogImage.jpg"}}