{
  "map": {
    "url": "",
    "alt": "",
    "caption": "",
    "description": ""
  },
  "title": "Creative Costuming & Colorful Themed Parties at Fantasy Fest 2018",
  "url_friendly_name": "creative-costuming-and-colorful-themed-parties-at-fantasy-fest-2018",
  "date": "2018-10-04T18:30:00.000Z",
  "short_description": "Get your game on as Key West gets ready to celebrate Fantasy Fest 2018: October 19 - 28, 2018. So many parties, so little time and that’s why want to focus on some of the cool, colorful and creative costuming parties during the ten-day festival.",
  "more_content": "<h2>Oh, The Games We Play in Key West, Florida</h2>\n<p>Get your game on as Key West gets ready to celebrate Fantasy Fest 2018: October 19 - 28, 2018. So many parties, so little time and that's why want to focus on some of the cool, colorful and creative costuming parties during the ten-day festival. Glow Parties, White, Red, Pink, Plaid, Blue and Green, themed parties - Beach and Pool parties, Tu-Tu's and Togas and a 60's 70's and 80'sparties. Welcome to Fantasy Fest Key West.</p>\n<h4>This year's Fantasy Fest theme is Oh, The Games We Play.</h4>\n<p>Whether you are a single player, multiplayer, or just a player, this year's theme is sure to get your cranium creating some costume ideas. Become your favorite game show host, bring to life your childhood board games, or transport yourself into your most loved netherworld. The ideas are endless, so roll the dice on your favorite game to play, and we'll see you in Key West for the festivities!</p>\n<p><img id=\"1538635212565\" class=\" \" src=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/large_ff-marker-pic2.jpg\" alt=\"Fantasy Fest\" data-image-large=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/large_ff-marker-pic2.jpg\" data-image-medium=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/medium_ff-marker-pic2.jpg\" data-image-small=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/small_ff-marker-pic2.jpg\" data-image-xsmall=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/xsmall_ff-marker-pic2.jpg\" data-image-thumb=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024006/thumb_ff-marker-pic2.jpg\" /></p>\n<p><a title=\"View the 2018 Fantasy Fest Schedule of Events\" href=\"https://fantasyfest.com/schedule/\" target=\"_blank\" rel=\"noopener noreferrer\">View the 2018 Fantasy Fest Schedule of Events</a></p>\n<h3>Colorful Creative Themed Parties</h3>\n<p>Get ready for 10 days filled with costumes, parades, libations, and excitement!&nbsp; Here's a quick look at some of the colorful themed parties and events happening across the island:</p>\n<h4>Tuesday, October 23rd</h4>\n<p><strong>BEACH BASH 2pm - 5pm</strong></p>\n<p>Join Patrick and the Swazyees in taking you back to the time of surfing, sun-bathing, and beach blanket bingo. Put on your favorite beach attire, sport your boldest bikini or don your newest tie-dye. Grab your flip-flops and head out to the beach to twist again, like you may have done last summer. Drink and food specials all afternoon along with beach activities and, of course, good old fashion fun! 2PM- 5PM at <a title=\"Southernmost Beach Cafe,\" href=\"http://www.southernmostbeachcafe.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Southernmost Beach Cafe,</a> 1405 Duval Street.</p>\n<p><strong>CAPT. TONY'S PARTY IN PLAID 8pm</strong></p>\n<p>Experience a party that caters to all exotic lifestyles and fantasies. Whether you wear your naughty or nice plaid to attract old friends or to stimulate the new, this party is for you.<br />Everyone is invited to this party for the ages that only the legendary Capt. Tony's can host. Great music and drinks, plaid costumes, exotic people. 428 Greene St. 8 PM; FREE.</p>\n<p><strong>GREEN PARROT GREEN PARTY 10pm</strong></p>\n<p>As once said by a famous frog - \"it's not easy being green!\" But we're not frogs, we're The Parrot, and day-in and day-out, we happily recycle our bottles, cups, and cans, and invite you on this night to rethink and reinvent yourself, maybe take your recyclables and reinvent a radical costume...or heck, just wear green...we won't throw you out! Be here as longtime Parrot-favorite Patrick and the Swayzees brings their nostalgic blend of Rock-a-Billy, Surf Rock and Doo Wop to the Green Party at The Green Parrot with shows at 10 pm and midnight. 601 Whitehead Street 305-294-6133</p>\n<p><img id=\"1538635287762\" class=\" \" src=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/large_ff-marker-pic3.jpg\" alt=\"Fantasy Fest\" data-image-large=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/large_ff-marker-pic3.jpg\" data-image-medium=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/medium_ff-marker-pic3.jpg\" data-image-small=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/small_ff-marker-pic3.jpg\" data-image-xsmall=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/xsmall_ff-marker-pic3.jpg\" data-image-thumb=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024121/thumb_ff-marker-pic3.jpg\" /></p>\n<p><strong>Photo Credit:</strong> (@sayhellojessiejo) on Instagram: \"@theswayzees are killing #fantasyfest week! Proud of my boys! #shotbyjjj\"</p>\n<h4>Wednesday, Oct. 24th</h4>\n<p><strong>ROCK AND ROLL REVITALIZING 1960'S POOL PARTY</strong><br />at <strong>The Marker Waterfront Resort</strong> 1pm - 4pm<br /><em>PRESENTED BY BLUE CHAIR BAY RUM at The Marker Waterfront Resort</em></p>\n<p>Let us take you back to a groovy time full of Tom Collins, Pink Squirrels and Greyhounds.&nbsp; <strong>Join us at the Marker Waterfront Resort</strong> for <em><strong>The Sixties Pool Party.</strong></em> Boogie down to live music, sip on a few of our nifty drink specials and have a guaranteed far out time. Featuring Patrick and the Swayzees Live Poolside! The Marker Waterfront Resort, 200 William Street.</p>\n<p><strong>WHARFSTOCK AT THE SCHOONER WHARF BAR - Starts at 7pm</strong></p>\n<p>\"Travel back in time to the <em>'60s, with Peace and Love Woodstock-style.</em> It&rsquo;s tie-dye, flower power, and psychedelic colors in a time capsule of the era at Schooner Wharf Bar. The Party starts at 7 PM. Prizes for sexiest Hippie Chick and Grooviest Dude -- judging at 8:30 PM. Enjoy live music and dance to tunes that reach back in time from Gary Hempsey and That Hippie Band from 7-midnight, plus cold drinks and great galley fare. Emceed by Magic Frank Everhart. Winners will receive cash prizes and gift certificates. 202 William St.; 305-292-3302; Starts at 7 PM; judging at 8:30 PM. No cover charge or entry fee.\"</p>\n<p><strong>LUCY'S BLUE PARTY PRESENTED BY BLUE CHAIR BAY RUM - 8pm</strong></p>\n<p>Come and dance under the sea at <em>Lucy&rsquo;s Retired Surfers Bar&rsquo;s BLUE PARTY!</em> Key West&rsquo;s coolest bar and restaurant is going all out for a night of marine-themed fun featuring live music . Throw together your most creative costume for our killer contest and a chance to win some awesome prizes! Sip on signature cocktails like the Shark Attack and keep the party rockin' with late night eats. Entry is $5 and all ticket sales go directly to our friends at Reef Relief. The party starts at 8pm at 221 Duval St.&nbsp;<img id=\"1538635338358\" class=\" \" src=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/large_ff-marker-pic4.jpg\" alt=\"Fantasy Fest\" data-image-large=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/large_ff-marker-pic4.jpg\" data-image-medium=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/medium_ff-marker-pic4.jpg\" data-image-small=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/small_ff-marker-pic4.jpg\" data-image-xsmall=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/xsmall_ff-marker-pic4.jpg\" data-image-thumb=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024209/thumb_ff-marker-pic4.jpg\" /></p>\n<p><strong>7th ANNUAL LUV2GLOW PARTY AT MARY ELLEN'S BAR - </strong>9pm<br /><em>PRESENTED BY TITO'S HANDMADE VODKA</em></p>\n<p>Do you love it in the dark? Do you love to glow? Do you love the coldest AC in old town? Then you&rsquo;ll <strong>LUV2GLOW at Mary Ellen's Bar</strong> when we turn out the lights and go dark with black lights, glow body paint and the hottest dance beats around! Watch your body glow while the hottest electronic DJs make your body move. Come party with our HOT Bartenders and SEXY GLO-GO Dancers! Put on your hottest neon or take it off and paint it up...this party is one of the most epic moments of Fantasy Fest! The beats drop at 9 PM; 420 Appelrouth Lane. 305-916-5816. $</p>\n<p><strong>FOGARTY'S RED PARTY - </strong>9pm</p>\n<p>Prepare to see RED! RED decorations, RED lights, RED drinks, and RED beach balls. <strong>It&rsquo;s Fogarty&rsquo;s Red Party!</strong> Wear as much or as little RED as you want but be sure to enter the annual costume party. Cash, gift certificates, and/or bar tabs will be the prizes for winner!! The DJ Jimmy Jamz will keep you dancing all night long. Join us for a fun RED filled night that everyone needs and deserves! Fogarty's 227 Duval St. 305-294-7525 9 PM</p>\n<h4>Thursday, Oct. 25th</h4>\n<p><strong>3rd ANNUAL WHITE PARTY - Doors open at 8pm</strong></p>\n<p>Come join the biggest party on the island at the <em>3rd Annual White Party</em>. We have something for every mood. Featuring DJs in two different venues to keep the party moving. The island&rsquo;s best live rock band, The DurtBags, rocking the night away in Durty Harry's. Enjoy your secret fantasies with the lovely ladies of the Red Garter. Let your artistic side glow under the black lights. Doors open 8 PM, 202 Duval St.</p>\n<p><strong>FAT TUESDAY PINK PARTY - 9pm</strong></p>\n<p><strong>\"Save the Ta-Tas!\" ~ Fat Tuesday Pink Party</strong>! A portion of the proceeds will be donated to the American Cancer Society - Making Strides Against Breast Cancer of the Florida Keys. Wear your sexiest pink costume or body painting to the best party on Thursday night. Costume contest with a $500 bar tab for 1st place, $250 bar tab for 2nd place and $100 bar tab for 3rd place. Live entertainment by DJ Buggy. Party favors while supplies last. 305 Duval St.; Fat Tuesday Pink Party ; 305-296-9373; 9 PM; $</p>\n<p><strong>IRISH KEVIN'S ANNUAL 80's PARTY</strong><br /><em>PRESENTED BY TITO's HANDMADE VODKA</em></p>\n<p>If you love rock and roll as much as we do, come bust a move at <strong>Irish Kevin's annual 80's party</strong>! Prepare your leg warmers and Members Only jackets. Dress head to toe in your best 80's costume with awards given throughout the day. We have live entertainment from open to close, but at 10:30 PM our full 80's band will keep you fighting for your right to party into the wee hours of Friday morning. 211 Duval St; 305-292-1262; 10:30 PM; $$.&nbsp;<img id=\"1538635377268\" class=\" \" src=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/large_ff-marker-pic5.jpg\" alt=\"Fantasy Fest\" data-image-large=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/large_ff-marker-pic5.jpg\" data-image-medium=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/medium_ff-marker-pic5.jpg\" data-image-small=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/small_ff-marker-pic5.jpg\" data-image-xsmall=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/xsmall_ff-marker-pic5.jpg\" data-image-thumb=\"//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-024250/thumb_ff-marker-pic5.jpg\" /></p>\n<h2>TuTu's &amp; Togas!</h2>\n<p><strong>TUTU TUESDAY Decade Dance (no TuTu no entry)</strong><br /><strong>Tuesday, Oct. 24th</strong></p>\n<p>10th Annual TUTU Party - DECADE-Dance. Come in your favorite tutu themed costume from the last Decade! We Will be celebrating the glory of the TuTu and all of its wonderment! Doors open at 7PM, $20 wristband admission, General Horseplay Complex-- ONE PARTY IN FOUR BARS, 423 Caroline Street, No TuTu - No Entry.</p>\n<p><strong>Sloppy Joe's 39th Annual Toga Party</strong><br /><strong>Thursday, Oct. 26th</strong></p>\n<p>Toga! Toga! Toga! Sloppy Joe's Toga Party is \"An ORIGINAL Fantasy Fest Event.\" Get your toga ON and find out why we are \"Still The Best Toga Party in Town!\" Transport yourself back in time with a traditional ancient Toga or dare to create your Toga using Fantasy Fest theme \"OH&hellip;the games we play.\"</p>\n<p>Best Togas will win Sloppy Joe's gift cards throughout the night. At 9:30 pm, we'll have a Toga Ceremony to award best Togas. Groups may participate in Ceremony (a group is 2-8 people). Audience will choose winner.<br />Above is just a spotlight on some of the events. Make sure to visit Fantasy Fest website to get the complete schedule of events.</p>\n<p><a title=\"Learn More About Fantasy Fest 2018\" href=\"http://www.fantasyfest.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Learn More About Fantasy Fest 2018</a></p>\n<p>We look forward to welcoming you to Key West for Fantasy Fest: <em>Oh, The Games We Play</em> and can't wait to see you all decked out with your colorful, creative costumes. Tag us and share your favorite events, costumes and tell us about the many games you played during Fantasy Fest 2018. #lovethemarker</p>",
  "image": {
    "alt": "",
    "caption": "",
    "description": "",
    "url": ""
  },
  "blogimage": {
    "name": "ff-marker-pic1",
    "file_name": "ff-marker-pic1.png",
    "url": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/ff-marker-pic1.png",
    "tags": "",
    "description": "",
    "date_added": "2018-10-04-023917",
    "file_type": "image/png",
    "width": 500,
    "height": 333,
    "file_size": 204307,
    "url_large": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/large_ff-marker-pic1.png",
    "url_medium": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/medium_ff-marker-pic1.png",
    "url_small": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/small_ff-marker-pic1.png",
    "url_xsmall": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/xsmall_ff-marker-pic1.png",
    "url_thumb": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/thumb_ff-marker-pic1.png",
    "path": "//cdn.traveltripper.io/site-assets/192_388_19604/media/2018-10-04-023917/ff-marker-pic1.png",
    "alt": "Fantasy Fest",
    "caption": ""
  }
}