{"title":"Celebrate the Coast Guard of the Florida Keys","blogimage":{"url":"/assets/images/coast-guard-blog.jpg"},"url_friendly_name":"celebrate-the-coast-guard-of-the-florida-keys","date":"2016-08-03","Posted_by":"Admin","short_description":"With deep ties in wrecking & shipping, the history of Key West revolves around its proximity to the Atlantic Coast.","image":{"url":"/assets/images/coast-guard-blog.jpg"},"more_content":"<p>With deep ties in <a href=\"https://en.wikipedia.org/wiki/Wrecking_(shipwreck)\" target=\"_blank\">wrecking &amp; shipping</a>, the history of Key West revolves around its proximity to the Atlantic Coast. The city even has a kid-friendly <a href=\"http://www.keywestshipwreck.com/\" target=\"_blank\">Shipwreck Museum</a>, enjoyed by those both young and old! Historically, Key West has been a major shipping port since the 19th century. In the years to come, the<a href=\"https://www.uscg.mil/\" target=\"_blank\"> United States Coast Guard </a>would establish a presence in both Key West and Marathon, Florida. Timed with Coast Guard Day and to celebrate those who serve and protect our coasts, <a href=\"http://www.themarkerkeywest.com/\">The Marker Resort </a>is highlighting the history of both <a href=\"https://www.uscg.mil/d7/staMarathon/\" target=\"_blank\">Station Marathon </a>and <a href=\"https://www.uscg.mil/d7/sectKeyWest/\" target=\"_blank\">Sector Key West!</a></p>\n<p>Michael Coccitto, husband of <a href=\"http://www.themarkerkeywest.com/blog-details/the-marker-employees-on-the-best-local-spots/\">The Marker&rsquo;s Assistant Director of Sales and Marketing</a>, Megan Coccitto, is Chief Petty Officer at <a href=\"https://www.uscg.mil/d7/staMarathon/\" target=\"_blank\">Station Marathon</a>. He shared this brief history of <a href=\"https://www.uscg.mil/d7/staMarathon/\" target=\"_blank\">Station Marathon</a> and its success:</p>\n<p>Station Marathon was established on June 22, 1964. In the beginning, the station was comprised of two utility boats. The Coast Guard detachment from Miami came to Marathon for a nine-month period usually from February through October. Operations were run out of a communications van and the crew of 14 stayed in a local motel. Coast Guard Station Marathon was established in Marathon because of the hostilities with Cuba, the influx of Cuban migrants and the ever-increasing boating population. The first officially commissioned station was nothing more than a two-story houseboat moored at the same boat basin in which our boats moor today. The 3.75 acres of land was purchased on January 6, 1966 from Mr. Bill Davis who had been leasing the land and pier space to the Coast Guard. The present station was commissioned on December 20, 1967. During the late 1970&rsquo;s and early 1980&rsquo;s Station Marathon&rsquo;s complement increased from 14 to 32 personnel. In the spring of 1985 the Station went through rehab. The boathouse, cottages, and pier were each torn down and rebuilt, and a launch ramp was installed. In November of 2004, Station Marathon was the first unit to successfully use warning shots/disabling fire against a migrant smuggling vessel. In October 2005, storm surge from Hurricane Wilma flooded the station buildings and grounds with four feet of seawater. In 2011 and again in 2013, Station Marathon received the coveted Sumner I. Kimball Readiness Award for operational readiness.</p>\n<p>Looking into <a href=\"https://www.uscg.mil/d7/sectKeyWest/\" target=\"_blank\">Sector Key West</a>, we discovered the following about its history in our southernmost city:</p>\n<p>Tracing back to 1824, <a href=\"https://www.uscg.mil/d7/sectKeyWest/\" target=\"_blank\">Sector Key West </a>took root as a permanent port fixture in Southern Florida. The port began rescuing those at sea, collecting maritime tariffs, chasing pirates, and cracking down on the smuggling of goods. The Coast Guard officially began in 1915, and merged with the Lighthouse Service in 1939, creating the Captain of the Port of Key West. As the size of the city of Key West grew, the Coast Guard has developed to accommodate the population. In order to improve the Coast Guard&rsquo;s protection capabilities, the Group of Key West and the Marine Safety Detachment Marathon, as well as the Marine Safety Office of Miami joined together to create the Sector Key West. Today the Sector Key West is responsible for <a href=\"http://www.uscg.mil/d7/sectKeyWest/about.asp\" target=\"_blank\">protecting 55,000 sq. miles </a>of water that borders the seas the Bahamas and Cuba.</p>\n<p>With the history of Station Marathon and Sector Key West in mind, we hope as you look out onto the waters of Key West, that you do so with a deeper appreciation. We want to thank our Coast Guard for protecting and ensuring the security of Southernmost Florida with their service every day. Share with us your photos of the picturesque Atlantic Coast during your time in Key West. Make sure to tag your photo with <a href=\"https://www.instagram.com/explore/tags/lovethemarker/\" target=\"_blank\">#LoveTheMarker</a>; You may be featured on our Instagram. Make sure to follow us on <a href=\"https://www.facebook.com/TheMarkerResort\" target=\"_blank\">Facebook</a>, <a href=\"https://twitter.com/TheMarkerResort\" target=\"_blank\">Twitter</a>, and <a href=\"https://www.instagram.com/themarkerresort/\" target=\"_blank\">Instagram </a>for a closer look into the heart of Key West.</p>"}