{"title":"Train like an Athlete, Marker Style","url_friendly_name":"train-like-an-athlete-marker-style","date":"2016-08-17","Posted_by":"Admin","short_description":"The games in Rio are in full swing, and all of us at The Marker couldn’t be more excited to celebrate and support! Historically, there have been two Key West natives to compete in the games; Rod Davis, who competed in sailing, and David Robinson, who competed in basketball.","more_content":"<p>The games in Rio are in full swing, and all of us at <a href=\"http://www.themarkerkeywest.com/\">The Marker</a> couldn&rsquo;t be more excited to celebrate and support! Historically, there have been two Key West natives to compete in the games; <a href=\"http://www.sports-reference.com/olympics/friv/birthplaces.cgi?id=13157\">Rod Davis</a>, who competed in sailing, and <a href=\"http://www.sports-reference.com/olympics/friv/birthplaces.cgi?id=13157\">David Robinson,</a> who competed in basketball. In this year&rsquo;s games there are a few athletes that hail from Florida: <a href=\"http://www.miamiherald.com/sports/olympics/article94752822.html\">Ashleigh Johnson</a>, competing on the U.S. Women&rsquo;s water polo team, <a href=\"http://www.miamiherald.com/sports/olympics/article94752822.html\">Nick Lucena</a>, a Florida State Alum competing in beach volleyball with his teammate (and won against Mexico!) along with <a href=\"http://www.miamiherald.com/sports/olympics/article94752822.html\">Robin Prendes</a> of Miami, racing in the lightweight men&rsquo;s four rowing competition. To bring some superior athletic motivation to your vacation lifestyle, we have created a surefire &ldquo;training plan&rdquo; from the time you arrive at our resort, to the time you&rsquo;re taking your final lap before departure to ensure a gold medal finish in epic vacationing!</p>\n<p><strong><u>The Opening Ceremony</u></strong><br /> Welcoming you to your perfect Key West getaway is our beautiful entryway, filled with the relaxing scent of burning candles and our focal point chandelier. After check-in, breeze through the tropical landscaped grounds on the way to your room. Before the &ldquo;games&rdquo; begin, take advantage of our <a href=\"http://www.themarkerkeywest.com/services---amenities/fitness-center/\">state-of-the-art fitness center</a>. In your downtime tap our <a href=\"http://www.themarkerkeywest.com/experiences/the-marker-experience/\">&ldquo;Conch&rdquo;-ierge</a> to share some of the nearby activities of Key West. From dolphin watching, to snorkeling, to dinner cruises, we&rsquo;re sure that you will find something that inspires you, after all, you&rsquo;re only steps away from the heart of Duval street!</p>\n<p><strong><u>Laps in the Pool</u></strong><br /> Take a dip in one of our three <a href=\"http://www.themarkerkeywest.com/services---amenities/pools/\">oasis pools</a>, perfect for a fun workout or a relaxing repose. In the true spirit of competition, rally up a group of friends to race across the pool! We aren&rsquo;t awarding medals, but you may be able to convince your friends to reward you with a refreshing margarita at the Cero Bodega bar. After your pool time hang out on a chaise lounge or grab a spot next to the TV at <a href=\"http://www.themarkerkeywest.com/drinks---dining/bar/\">the bar</a> for prime viewing of the athletes competing in their various sports.</p>\n<p><strong><u>The Victory Lap </u></strong><br /> What better way to finish off a successful vacation than with a victory lap, or in this case, a victory round of drinks! We are currently offering the following themed drink specials throughout the month of August at <a href=\"http://www.themarkerkeywest.com/drinks---dining/cero-bodega/\">Cero Bodega</a>. The Frozen Flag: a three-layered drink in true red, white, and blue! Featuring a layer of blue frozen Curacao atop mix of Tequila and frozen lime daiquiri, and finished off with a bottom layer of frozen strawberry daiquiri. To highlight an iconic American athlete, we have a Spiked Arnold Palmer: a chilled iced tea spiked with Deep Eddy Lemon Vodka, and Boulevard Lemon Ginger Radler. Our final drink special inspired by the 2016 Summer games is a traditional Brazilian Caiprinha, served on the rocks. We drop in two lime quarters, and muddle them with sugar. Add in Brazilian Brandy, top with ice, and enjoy!</p>\n<p>Are you as excited about the games as we are? Make sure to tag your photo with <a href=\"https://www.instagram.com/explore/tags/lovethemarker/\"><em>#LoveTheMarker</em></a> during your stay, you may be featured on our Instagram. Make sure to follow us on <a href=\"https://www.facebook.com/TheMarkerResort\"><em>Facebook</em></a><em>, </em><a href=\"https://twitter.com/TheMarkerResort\"><em>Twitter</em></a><em>, and </em><a href=\"https://www.instagram.com/themarkerresort/\"><em>Instagram</em></a>for a closer look into the heart of Key West and our poolside games and themed drinks!</p>","image":{"url":"/assets/images/train_athlete.jpg"}}