{"title":"Conch Architecture","blogimage":{"url":"https://cdn.traveltripper.io/site-assets/202_388_1258/media/2017-02-08-012708/conch-blog.jpg"},"url_friendly_name":"conch-architecture","date":"Wed Feb 08 2017 00:00:00 GMT+0530 (India Standard Time)","Posted_by":"Admin","short_description":"With art, culture, and architecture at the heart of Key West, it’s impossible not to discover what makes the city so special during your time here. When walking the city’s streets, you’ll be surrounded by brightly painted houses, tropical breezes, and glowing sunshine overhead.","more_content":"<p><strong>History &amp; Design&nbsp;</strong></p>\n<p>With art, culture, and architecture at the heart of Key West, it&rsquo;s impossible not to discover what makes the city so special during your time here. When walking the city&rsquo;s streets, you&rsquo;ll be surrounded by brightly painted houses, tropical breezes, and glowing sunshine overhead. The homes in Key West are perfect for brightening your day (and your Instagram feed!) Conch architecture&rsquo;s history is influenced by Key West&rsquo;s early immigrants and the warm costal climate, leading to the unique homes you see today. Take a moment to learn how Conch architecture came to be, and use your new knowledge to speak to the design elements you see around town!</p>\n<p><strong>Brief History of Conch Architecture</strong></p>\n<p>Conch architecture was developed by Bahamian immigrants called &ldquo;<a href=\"https://en.wikipedia.org/wiki/Conch_house\">Conchs</a>&rdquo; in the 19th century. Influenced by <a href=\"http://www.floridakeysbest.com/key_west_conch_style/nfch.htm\">Gulf Coast</a> building techniques, as well as <a href=\"https://www.coolkeywest.com/architecture/\">New England</a> architecture, Conch buildings spread throughout The Keys and parts of Miami. In Old Town Key West alone there are &ldquo;over <a href=\"https://www.coolkeywest.com/architecture/\">3,000 wooden buildings</a> dating from 1886 to 1912,&rdquo; not to mention it being &ldquo;the <a href=\"https://www.coolkeywest.com/architecture/\">largest historical district</a> on the US Department of the Interior&rsquo;s National Register of Historic Places.&rdquo;&nbsp;</p>\n<p><strong>Conch Design Elements</strong></p>\n<p><a href=\"http://www.floridakeysbest.com/key_west_conch_style/nfch.htm\">Conch homes</a> have mortar made of sand, water, and lime. The early Bahamian settlers lacked stones and bricks, so they looked to the abundant conch shells as their as a replacement, obtaining the lime for the mortar by burning <a href=\"http://www.floridakeysbest.com/key_west_conch_style/nfch.htm\">conch shells</a>. &nbsp;</p>\n<p>The climate and weather of the keys was one of the defining elements that influenced Conch architecture. <a href=\"https://en.wikipedia.org/wiki/Conch_house\">Homes in the Bahamas</a> were commonly made of clapboard, which with the help of the Bahamian immigrants, translated over to Conch architecture. This type of building originally used <a href=\"https://oirf.org/page.php?p=keywest\">South Florida slash pine</a> and <a href=\"https://oirf.org/page.php?p=keywest\">Dade County pine</a> as clapboard, but high demand caused this material to decline in availability. Looking to new resources yellow pine, cedar, and cypress became the new standard. &nbsp;</p>\n<p>With the threat of potential hurricanes, surging storms and humidity, certain design elements were implemented to help Conch homes survive the coastal heat. For example, sloping metal roofs that reflected the sun to keep homes cool year-round. Additionally, metal roofs became the standard and replaced shingled roofs as a response to a <a href=\"https://www.coolkeywest.com/architecture/\">series of fires through Old Town Key West</a>. Homes were <a href=\"https://www.coolkeywest.com/architecture/\">built on props</a> above the ground in an effort to avoid potential rot from seeping moisture. Props also helped to increase air circulation under the homes. Lastly, a few curb appeal elements such as porches and shutters allowed for air circulation during hot, humid days. As for the Conch homes&rsquo; eye-catching colors? <a href=\"https://www.coolkeywest.com/architecture/\">Caribbean influences</a> are the driving force behind the vibrant hues!&nbsp;</p>\n<p>Looking for the best way to get around town to see some Conch Architecture spots? Look no further than the <a href=\"https://www.conchtourtrain.com/key-west-attractions.html\">Conch Tour Train</a>. The Harry S. Truman Little White House, Audubon House, and the Oldest House in Key West are all stops on the tour, each featuring their own element of Conch Architecture! Not to mention, the <a href=\"http://www.fla-keys.com/news/article/9040/\">Old Island Restoration Foundation</a>&rsquo;s 55th annual tour of historic homes in Key West is coming up in February &amp; March of 2017. Make sure to snap some photos along the way and share with us on <a href=\"https://www.instagram.com/themarkerresort/?hl=en\">Instagram</a> by using #LoveTheMarker on your Conch-inspired photos.&nbsp;</p>"}