{
	"blogimage": {
		"url": "https://cdn.traveltripper.io/site-assets/202_388_1258/media/2017-03-02-031030/east-martello.jpg"
	},
	"title": "Forts of Key West",
	"url_friendly_name": "forts-of-key-west",
	"date": "Thu Mar 02 2017 00:00:00 GMT+0530 (India Standard Time)",
	"categories": "Key West Events",
	"tags": [
		"Explorations",
		"Key West Events"
	],
	"Posted_by": "Admin",
	"short_description": "Key West’s history can be seen all through the city, from its conch architecture, to the Harry S. Truman Little White House, and more. You may have heard about Key West’s nearby forts as great places to take a day trip or to lay on the beach with the family. In addition, the local fort’s historical significance dates back to when Florida was just becoming part of the United States.",
	"more_content": "<p>Key West&rsquo;s history can be seen all through the city, from its <a href=\"https://www.themarkerkeywest.com/blog-details/conch-architecture/\">conch architecture</a>, to the <a href=\"https://www.themarkerkeywest.com/blog-details/the-harry-s-truman-little-white-house/\">Harry S. Truman Little White House</a>, and more. You may have heard about Key West&rsquo;s nearby forts as great places to take a day trip or to lay on the beach with the family. In addition, the local fort&rsquo;s historical significance dates back to when Florida was just becoming part of the United States. Highlighted below are local favorites Fort Jefferson, Fort Zachary Taylor and both Fort East and West Mortello. Read on for some day trip inspiration to add some history and sunshine to your vacay!&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Dry Tortugas National Park of the Florida Keys, Fort Jefferson</strong></p>\n<p>Built from a whopping <a href=\"https://en.wikipedia.org/wiki/Fort_Jefferson\">16 million bricks</a>, Fort Jefferson is part of the Dry Tortugas National Park of the Florida Keys, 70 miles west of Key West. After Key West was purchased from the Spanish in the 19th century, the fort was utilized to monitor the waters off of the Gulf of Mexico and the Straits of Florida. The Fort offered a stopping place for ships and their crews to resupply, or seek shelter during treacherous <a href=\"https://www.nps.gov/drto/learn/historyculture/fort-jefferson.htm\">storms at sea</a>. In recent years, there have been extensive <a href=\"https://www.nps.gov/drto/learn/historyculture/fort-jefferson.htm\">perseveration efforts</a>. The way in which the fort was initially built, many architectural features were implemented that were indeed advanced at the time, but later caused issues that lead to the fort&rsquo;s demise. To protect the cannon openings, iron shutters were placed over top of them. However, as the iron rusted it expanded, decayed and started to disrupt the foundation. Overall, the harsh environment and salt that comes along with the ocean&rsquo;s coast was responsible for the Fort&rsquo;s constant <a href=\"https://www.nps.gov/drto/learn/historyculture/fort-jefferson-preservation.htm\">costly upkeep costs</a>.</p>\n<p>&nbsp;</p>\n<p><strong>Fort Zachary Taylor Historic State Park</strong></p>\n<p>Construction began in 1845 when Florida <a href=\"http://www.fortzacharytaylor.com/park-and-fort.html\">officially became a state</a> in the United States of America. While the fort was being built, U.S. <a href=\"http://www.fortzacharytaylor.com/park-and-fort.html\">President Zachary Taylor</a> died, leading the fort to be named in his honor. Construction continued well into the 1850s and was tumultuous at times due to the construction workers being subject to illness. Due to location of the fort, there were periods of time that Florida lacked supplies and could not easily gain access to materials. Fort Zachary Taylor played a role in the <a href=\"http://www.fortzacharytaylor.com/park-and-fort.html\">Civil War</a> and again during the Spanish-American, entwining the fort in some of history&rsquo;s most pivotal moments. The Fort became a landmark in 1873, and was officially <a href=\"https://en.wikipedia.org/wiki/Fort_Zachary_Taylor_Historic_State_Park\">landlocked in the 1960s</a>. Currently, <a href=\"http://www.fortzacharytaylor.com/beach.html\">Fort Zachary Taylor</a> is the perfect place swimming, snorkeling, and walks beside the Key West Shipping Channel. &nbsp;The park covers a total of 54 acres and exhibits lush foliage, and beautiful wildlife. Every day at 11am there are tours around the historic fort. Some of their unique annual offerings include a pirate festivals, boat races, and more!</p>\n<p>&nbsp;</p>\n<p><strong>Fort East and West Mortello</strong></p>\n<p>Construction on both forts began in <a href=\"http://www.kwahs.org/museums/fort-east-martello/history\">1862 by the U.S. Army</a> in an effort to protect the city against the threat of the Confederates. The forts were built as a pair; Fort East Mortellos&rsquo; identical twin counterpart appropriately deemed Fort <a href=\"http://www.kwahs.org/museums/fort-east-martello/twinforts\">West Mortello</a>. However, construction was halted due to yellow fever and the aftermath of a hurricane in 1865. During the Civil War, Key West was under Union control, which caused a rift as much of the city was Confederate supporters. When the Civil War drew to a close the forts no longer played a crucial role and were abandoned. The forts were later revitalized and restored <a href=\"http://www.kwahs.org/museums/fort-east-martello/history\">in 1950</a> by volunteers from the <a href=\"http://www.kwahs.org/about-us\">Key West Art &amp; Historical Society</a>. Today the <a href=\"http://info.flheritage.com/maritime-trail/forts/fort.cfm?name=East_Martello_Battery\">Fort East Mortello Museum &amp; Gardens</a> draws many locals and visitors, complete with <a href=\"https://www.themarkerkeywest.com/blog-details/halloween-haunts-in-key-west/\">Robert the Doll</a>, an infamous spooky Key West legend among some of its most interesting artifacts!</p>\n<p>&nbsp;</p>\n<p>Planning on venturing to one of Key West&rsquo;s local forts or state parks? Make sure to snap some photos along the way and share with us on <a href=\"https://www.instagram.com/themarkerresort/?hl=en\">Instagram</a> by using #LoveTheMarker on your day-cation photos.&nbsp;</p>"
}