{
  "title": "Key West Holiday Event Lineup",
  "blogimage": {
    "url": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/line-up-header.jpg",
    "path": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/line-up-header.jpg",
    "file_type": "image/jpeg",
    "name": "line-up-header",
    "tags": "",
    "url_large": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/large_line-up-header.jpg",
    "url_thumb": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/thumb_line-up-header.jpg",
    "url_medium": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/medium_line-up-header.jpg",
    "url_small": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/small_line-up-header.jpg",
    "url_xsmall": "//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004257/xsmall_line-up-header.jpg",
    "width": 1000,
    "height": 665,
    "file_size": 152600,
    "alt": "Holiday Event Line Up",
    "caption": "",
    "description": ""
  },
  "url_friendly_name": "key-west-holiday-event-lineup",
  "date": "Wed Nov 15 2017 00:00:00 GMT+0530 (India Standard Time)",
  "short_description": "There’s no place like Key West for the holidays and there is no shortage of fun holiday events and happenings taking place right in our backyard.",
  "more_content": "<p>Photo credit: ROB O'NEAL/The Citizen</p>\n<p>There&rsquo;s no place like Key West for the holidays and there is no shortage of fun holiday events and happenings taking place right in our backyard.&nbsp; Holiday parades by land and sea, with house tours, holiday shows and concerts, bike parades, boat parades, art fairs and holiday shopping!.&nbsp; Tis the season to be jolly and Ho Ho Ho!&nbsp; Here is the Key West Holiday Season Event Lineup.</p>\n<p><strong>Lighting of the Key West &ldquo;Harbor Walk of Lights&rdquo;</strong></p>\n<p>Wednesday, November 22nd at 6 pm</p>\n<p>The Holiday Season in Key West kicks off on November 22nd as the Historic Seaport Lights up with the Lighting of the Key West &ldquo;Harbor Walk of Lights.&rdquo;&nbsp; Head over to the Harbor Walk at Green and Elizabeth Street to view the official lighting of the 2017 Key West Harbor Walk of Lights.&nbsp; The Harbor Walk of Lights will be lit up every evening through New Year&rsquo;s Eve!</p>\n<p><strong>Key West Holiday Parade&nbsp;</strong></p>\n<p>Saturday, December 2nd - Parade starts at 7 pm</p>\n<p>If you want to be part of a hometown local parade then join us for the City of Key West Holiday Parade on Saturday, December 2nd.&nbsp; Marching Bands, floats, school groups, trolleys, cars, bikes all decorated to celebrate the holiday season.&nbsp; This is one of our favorite Key West parades fun for every age.&nbsp; Children sit curbside with open eyes waiting for Santa as well as catching tossed candy from the floats.&nbsp; It all begins at Bayview Park and best viewing spots are along Duval Street and Truman Avenue.&nbsp;&nbsp;</p>\n<p><strong>Key West Lighted Bike Ride</strong>&nbsp;</p>\n<p>Wednesday, December 6th - Registration 6 pm, Bike Ride Begins at 7 pm&nbsp;</p>\n<p>Oh what fun!!!&nbsp; Decorate your bike, dress up and join us for the Key West Lighted Bike Ride.&nbsp; The streets of Key West will glow as bikes are lit up to help gather needed toys for the struggling, working families of Key West for the holidays. This is a fun family event beginning with registration and check in at 6 pm - at Bay View Park - and bike ride beginning at 7 pm. Registration for the ride is one unwrapped toy for the Key West Holiday Helpers Toy Store.&nbsp;</p>\n<p>Holiday Movie Night at The Marker Resort</p>\n<p>Thursday, December 7th, 6 pm&nbsp; - 10 pm</p>\n<p><strong>Holiday Movie &ldquo;ELF&rdquo; Poolside at The Marker Waterfront Resort</strong></p>\n<p>Join us for a special holiday movie night poolside at The Marker. Bring your friends, wear your bathing suit, and enjoy drink specialss, $5 food plate specials and more while watching &ldquo;Elf.&rdquo;&nbsp; We will aslo have holiday photo opportunities with &ldquo;Bad Santa&rdquo; Landon Bradbury and Photographer Nick Doll.&nbsp; &nbsp;Come early, have a holiday drink or two and mix and mingle with us during Holiday Movie Night.&nbsp; &nbsp;</p>\n<p><strong>Schooner Wharf Bar Annual Lighted Boat Parade&nbsp;</strong></p>\n<p>Saturday, December 9th - Parade starts at&nbsp; 8 pm</p>\n<p>Deck the hulls as the Key West Historic Seaport and harbor areas are lit up with lighted and decorated vessels from rowboats to tall ships.&nbsp; Welcome to the Schooner Wharf Bar Annual Lighted Boat Parade!&nbsp; The Judges Stand is located at Schooner Bar so why not hang out, grab a drink, enjoy the music and holiday festivities as the boats pass by in paradise.&nbsp; The parade is scheduled to begin at 8 p.m. and there will be festivities beginning at 6pm with live music and holiday happenings all around the Historic Seaport.</p>\n<p><strong>Studios of Key West's Holiday Artisan Market&nbsp;</strong></p>\n<p>Saturday, December 9th, 9am - 2pm&nbsp;</p>\n<p>Local artists come together for a festive island shopping experience! Enjoy cookies and coffee as you stroll through a friendly, festive indoor market. Over 20 artisans present unique and locally produced gifts: jewelry, textiles, home accessories and quality crafts. From 9 a.m. to 2 p.m., Studios of Key West, 533 Eaton Street.&nbsp;</p>\n<p><strong>Waterfront Playhouse presents: Inspecting Carol&nbsp;</strong></p>\n<p>December 14 - Jan 06, 2018, in Key West</p>\n<p>Attend a Holiday Play at the Waterfront Playhouse!&nbsp; Grab a large helping of holiday cheer with this hilarious, madcap comedy! It's a cross between A Christmas Carol and Noises Off. Behind the scenes of a struggling theatre's annual slapdash production of A Christmas Carol, rehearsals are at a standstill. Tim is no longer Tiny, Scrooge wants to do the play in Spanish (Feliz Navidad), and their funding is on hold pending an inspection. This laugh out loud spoof makes for a night at the theatre that is anything but show business as usual. \"Inspecting Carol\" is a delightful mix of \"A Christmas Carol,\" \"Noises Off,\" \"Waiting for Guffman.\"&nbsp;&nbsp;</p>\n<p><strong>Sugar Rum Cherry: A Burlesque Nutcracker&nbsp;</strong></p>\n<p>December 14th - 16th - doors open at 7:30pm, show starts at 8pm</p>\n<p>Head over to the Key West Theater for a holiday burlesque nutcracker!&nbsp; Put on your stockings and pull out your sugarplums for Key West Burlesque's \"Sugar Rum Cherry: A Burlesque Nutcracker.\" This naughty holiday 2-act reverie features your favorite local performers, international burlesque superstars, and amazing aerial acrobats as they visit the land of libations. Doors open at 7:30 p.m., show starts at 8:00 p.m. Performance at Key West Theater, 512 Eaton Street.&nbsp;</p>\n<p><strong>Monthly Artisan Market, A Holiday &ldquo;Shop Local&rdquo; Edition&nbsp;</strong></p>\n<p>December 17th, 10am - 2pm&nbsp;</p>\n<p>Another shopping opportunity before the holiday!&nbsp; Browse the vibrant open-air bazaar filled with Keys artists, authors, chef-made cuisine, craftspeople and performers. Admission is free and the market is open to the public from 10 a.m. to 2 p.m. every third Sunday of each month at 1111 Eaton Street (parking lot of The Restaurant Store.)</p>\n<p><strong>58th Annual Key West House &amp; Garden Tours</strong>&nbsp;</p>\n<p>December 27th &amp; 28th 3pm - 7pm each day</p>\n<p>This is your opportunity to tour festively dressed Key West homes and gardens.&nbsp; If you have a chance attend the Old Island Restoration Foundations 58th Annual Key West House &amp; Garden Tours.&nbsp; They are self guided tours taking place from 3pm-7 p.m. each day. Tickets are $30 in advance, $35 day-of-tour. Proceeds benefit the foundation's museum and programs.&nbsp;</p>\n<p><strong>Key West Dachshund Walk&nbsp;</strong></p>\n<p>December 31st at NOON&nbsp;</p>\n<p>Frost-free Key West becomes a \"wiener wonderland\" when about 200 dachshunds and their owners take a noontime New Year's Eve stroll through the island's picturesque downtown. This is another fun quirky parade with our pups as the stars of the show.&nbsp; Spectators can watch the fun and meet the canine participants on Fleming Street between Whitehead and Duval streets.&nbsp;</p>\n<h4>Where will you be on New Year&rsquo;s Eve?&nbsp;</h4>\n<p><img id=\"1510726475718\" class=\" \" src=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/line-up-2017.jpg\" data-image-large=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/large_line-up-2017.jpg\" data-image-medium=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/medium_line-up-2017.jpg\" data-image-small=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/small_line-up-2017.jpg\" data-image-xsmall=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/xsmall_line-up-2017.jpg\" data-image-thumb=\"//cdn.traveltripper.io/site-assets/202_388_9327/media/2017-11-15-004254/thumb_line-up-2017.jpg\" /></p>\n<p>Photo: Rob O'Neal/Florida Keys News Bureau via AP</p>\n<p>Decisions. Decisions.&nbsp; At midnight in Key West you have the opportunity to watch a <a title=\"Conch Shell drop at Sloppy Joe&rsquo;s Bar\" href=\"http://www.sloppyjoes.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Conch Shell drop at Sloppy Joe&rsquo;s Bar</a>, a <a title=\"New Year&rsquo;s Eve Shoe Drop by Sushi\" href=\"http://www.bourbonstpub.com/\" target=\"_blank\" rel=\"noopener noreferrer\">New Year&rsquo;s Eve Shoe Drop by Sushi</a> at the Bourbon Street Pub/New Orleans House complex or watch the <a title=\"Lowering of the Wench at Schooner Wharf Bar\" href=\"http://www.schoonerwharf.com/12countdown.htm\" target=\"_blank\" rel=\"noopener noreferrer\">Lowering of the Wench at Schooner Wharf Bar</a>.&nbsp; So many options on one special night!&nbsp; Wherever you are we wish you a safe and happy holiday season!&nbsp;</p>\n<p>Happy Holidays and Happy New Year!&nbsp; <strong>#lovethemarker</strong></p>"
}