{"title":"12 Days of Key West: An Itinerary of Top Spots to Spend the Holidays","categories":"Key West Events","url_friendly_name":"12-Days-of-Key-West","date":"Tue Dec 13 2016 00:00:00 GMT+0530 (India Standard Time)","tags":["Explorations","Key West Events"],"Posted_by":"Admin","short_description":"The holidays are here again and holiday cheer is ringing through the keys! Playing off of the holiday classic “The Twelve Days of Christmas,” we’ve come up with 12 days of local holiday things to do from finding gifts for friends & family to experiencing unique spots and events in the city.","more_content":"<p>The holidays are here again and holiday cheer is ringing through the keys! Playing off of the holiday classic &ldquo;The Twelve Days of Christmas,&rdquo; we&rsquo;ve come up with 12 days of local holiday things to do from finding gifts for friends &amp; family to experiencing unique spots and events in the city. After all, the holidays are a time to reflect on the past year and spend time with the ones you love. Whether you are looking for unique presents or simply fun events in Key West, we&rsquo;re sure that you&rsquo;ll find something on our list.</p>\n<p><strong>1)</strong> We&rsquo;re kicking off with a little inspiration from a partridge in a pear tree and helping the environment. In the spirit of the season of giving we&rsquo;re highlighting a local Key West volunteer organization, <a href=\"http://growinghopeinitiative.org/\" target=\"_blank\">Grimal Grove</a>, that works towards <a href=\"http://growinghopeinitiative.org/mission-and-vision\" target=\"_blank\">education, artistic development, community welfare, and environmental health</a> in the Florida Keys. We know that giving back to the community is one of the best gifts to give and encourage you to donate to organizations near to your heart.</p>\n<p><strong>2)</strong> Trade turtledoves for a stop at the <a href=\"http://www.keywestturtlemuseum.org/museum\" target=\"_blank\">Key West Turtle Museum</a>; only a 5-minute walk from <a href=\"http://www.themarkerkeywest.com/\">The Marker Resort</a>! The museum will open your eyes to some surprising facts, like how <a href=\"http://www.keywestturtlemuseum.org/museum\">archaeological evidence</a> showed that in years long past, Key West natives relied on turtles as a food source. Or, how <a href=\"http://www.keywestturtlemuseum.org/museum\" target=\"_blank\">in the 1900s</a> the turtle population drastically dropped from over fishing, leading to preservation and educational efforts to protect the turtles. After learning about the history of turtles, see them in person at the <a href=\"https://www.keywestaquarium.com/about-aquarium\" target=\"_blank\">Key West Aquarium</a>. &nbsp;</p>\n<p>&nbsp;</p>","blogimage":{"url":"https://cdn.traveltripper.io/site-assets/202_388_1115/media/2016-12-15-023459/Marker12DaysBlogImage.jpg"}}