{
	"categories": "Uncategorized",
	"Posted_by": "Admin",
	"title": "Old Dominion, Maren Morris, Cam to Headline the 2017 Key West Songwriters Festival.",
	"date": "Tue May 02 2017 00:00:00 GMT+0530 (India Standard Time)",
	"url_friendly_name": "old-dominion-maren-morris",
	"blogimage": {
		"url": "https://cdn.traveltripper.io/site-assets/202_388_2603/media/2017-05-02-054529/Old-Dominion-Concert.jpg"
	},
	"short_description": "Top songwriters are heading to Key West for the 22nd Annual Key West Songwriters Festival May 10th -14th where more than 200 Singer/Songwriters are scheduled to perform at over 50 indoor and outdoor venues across the island.",
	"more_content": "<p>Top songwriters are heading to Key West for the 22nd Annual Key West Songwriters Festival May 10th -14th where more than 200 Singer/Songwriters are scheduled to perform at over 50 indoor and outdoor venues across the island. Sony Music Nashville recording artists Old Dominion, Maren Morris, and Cam will take the Main Stage Duval Street Concert (Free), hosted by Storme Warren, Saturday, May 13th at 7pm. &nbsp;Other artists performing include: Chuck Cannon, Even Stevens, Robert Earl Keen, Michael Ray, William Michael Morgan, Shawn Camp, Jeffrey Steele, Liz Rose, Dylan Altman Blues Band and more... &nbsp; Make sure to view the Key West Songwriters Festival 2017 Artists List to find out if one of your favorite artists will be performing.</p>\n<p>Proceeds from the Key West Songwriters Festival will benefit the BMI Foundation, a nonprofit organization that has supported the creation, performance, and study of music through awards, scholarships, grants and commissions since 1985.</p>\n<h3>Why You Should Attend</h3>\n<p>There are so many reasons why you should attend the Key West Songwriters Festival and here are just a few:</p>\n<ul>\n<li>The Key West Songwriters Festival allows you to get up close and personal with the top singer/songwriters and learn about the artists, songs and the stories behind them.&nbsp;</li>\n<li>Enjoy the sights, sounds and tropical vibe of island life and step inside some of our favorite and iconic Key West bars, restaurants, hotels, beaches and historic theaters.</li>\n<li>Most of the festival shows are FREE to enter. &nbsp;There are some ticketed events. &nbsp;Check out the Key West Songwriters Festival Schedule of Events to find out who is playing where and when.</li>\n<li>200 Singer/Songwriters with over 50 performances over five days and nights in Key West...that says it all!</li>\n</ul>\n<p><img id=\"1493718703294\" class=\" \" src=\"https://cdn.traveltripper.io/site-assets/202_388_2603/media/2017-05-02-054530/Songwriters-for-Marker.png\" /></p>\n<h3>Songwriters and Pool Parties at The Marker Waterfront Resort</h3>\n<p>Get ready to kick back, relax poolside and enjoy the top Songwriters and Artists perform poolside at our Key West resort.</p>\n<p><strong>Poolside Party at The Marker Waterfront Resort&nbsp;</strong></p>\n<p>Thursday, May 11th&nbsp;</p>\n<p>5:30pm - Adam Ezra, Sonia Leigh</p>\n<p>6:30pm - Phillip White, Emily Reid</p>\n<p>Free Show, No Ticket Required</p>\n<p><strong>Pool Party at The Marker Waterfront Resort&nbsp;</strong></p>\n<p>Saturday, May 13th</p>\n<p>12:00pm - Michael Hardy, Jake Mitchell</p>\n<p>1:00pm - XAXO</p>\n<p>2:00pm - Nick Norman, Joal Rush&nbsp;</p>\n<p>Free Show, No Ticket Required&nbsp;</p>\n<p>We hope you will join us for five days of music, pool parties, concerts and more during the 2017 Key West Songwriters Festival. &nbsp;To learn more about the festival visit kwsf.com.&nbsp;</p>\n<p>&nbsp;</p>"
}