{"title":"The Harry S.Truman Little White House","url_friendly_name":"The-Harry-S-Truman-Little-White-House","date":"Thu Dec 22 2016 00:00:00 GMT+0530 (India Standard Time)","categories":"Key West Events","tags":["Explorations"],"Posted_by":"Admin","short_description":"Home to the state’s only presidential site, Key West is proud to have The Harry S. Truman Little White House in the southernmost city. When our guests ask us some of the can’t miss spots in the keys, we always recommend the Little White House. Make sure to stop in during your time in the city; The museum offers daily walking tours with knowledgeable guides every 15-20 minutes.","more_content":"<h3>A Look into History: The Harry S. Truman Little White House</h3>\n<p>Home to the state&rsquo;s only presidential site, Key West is proud to have <a href=\"https://www.trumanlittlewhitehouse.com/\" target=\"_blank\">The Harry S. Truman Little White House</a> in the southernmost city. When our guests ask us some of the can&rsquo;t miss spots in the keys, we always recommend the <a href=\"https://www.trumanlittlewhitehouse.com/\" target=\"_blank\">Little White House</a>. Make sure to stop in during your time in the city; The museum offers daily walking tours with knowledgeable guides every 15-20 minutes. The guides love to share special tidbits of history, such as how <a href=\"https://www.trumanlittlewhitehouse.com/key-west/president-truman-biography.htm\" target=\"_blank\">President Harry S. Truman</a> and his cabinet entertained themselves with everything from <a href=\"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House\" target=\"_blank\">poker games to fishing trips</a> while they enjoying their time in the keys. Below we&rsquo;ve provided a bite-sized history of the presidential site and Truman&rsquo;s time there. We hope this inspires you to embrace the keys the way the he did and visit this &ldquo;little&rdquo; house of history.&nbsp;</p>\n<p>&nbsp;</p>\n<h3>History:</h3>\n<p>The Harry S. Truman Little White House was originally built in 1890 to house naval officers. This was fitting for the city, as Key West has historically been an active site for the U.S. Navy and Coast Guard. 21 years later the site was<a href=\"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House\" target=\"_blank\"> converted into a single-family home</a>. During his presidency Truman took a liking to Key West&mdash;which lead to 175 days of his presidency in the Little White House over the course of 11 visits! He <a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\">dealt with the political and social issues of the time</a>: from nuclear weapons, to rebuilding the country&rsquo;s morale following WWII, and addressing the initial phases of the Cold War. Truman&rsquo;s visits didn&rsquo;t stop once he left office&mdash;from <a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\">1957-69 he visited Key West 5 times</a> and stayed at a private residence in lieu of the Little White House. The historic site and museum is currently <a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\">owned by the State of Florida</a> and has been restored through the generous support from various donors.&nbsp;</p>\n<p>It&rsquo;s important to note that Truman wasn&rsquo;t the only president to make their way down to sunny Key West. The first ever President to visit was <a href=\"https://en.wikipedia.org/wiki/William_Howard_Taft\" target=\"_blank\">William Howard Taft</a> in <a href=\"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House\">December of 1912</a>. While Truman made the most frequent visits to Key West of any president, other notable presidents stayed on property including <a href=\"https://en.wikipedia.org/wiki/Dwight_D._Eisenhower\" target=\"_blank\">Dwight Eisenhower,</a> <a href=\"https://en.wikipedia.org/wiki/John_F._Kennedy\" target=\"_blank\">John Kennedy</a>, and <a href=\"https://en.wikipedia.org/wiki/Jimmy_Carter\" target=\"_blank\">Jimmy Carter</a>. Most recently <a href=\"https://en.wikipedia.org/wiki/Bill_Clinton\" target=\"_blank\">Bill Clinton</a> visited during his presidency and spent time enjoying the warm weather and laidback feel of the city in 2005 with wife, <a href=\"https://en.wikipedia.org/wiki/Hillary_Clinton\" target=\"_blank\">Hillary Clinton</a>.&nbsp;</p>\n<p>&nbsp;</p>\n<h3>Fun Facts:</h3>\n<p>-During WWI, Thomas Edison stayed on site and helped in crafting <a href=\"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House\" target=\"_blank\">41 underwater weapons</a>.&nbsp;</p>\n<p>-During WWII, the site was used a command headquarters.</p>\n<p>-The Little White House was officially considered a <a href=\"https://en.wikipedia.org/wiki/Harry_S._Truman_Little_White_House\" target=\"_blank\">state historic site &amp; museum in 1991</a>.&nbsp;</p>\n<p>-The home exhibits both <a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\">Victorian and West Indian</a> architectural details.</p>\n<p>-<a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\">The Department of Defense</a> was created at The Little White house after merging the&nbsp;Department of War and the Department of Navy.&nbsp;</p>\n<p>-Most of the furnishings are the original to the 1949 remodeling for President Truman.&nbsp;</p>\n<p>-2016 marks what would have been the 132nd birthday of the late <a href=\"https://www.trumanlittlewhitehouse.com/key-west/president-truman-biography.htm\" target=\"_blank\">President Truman</a>.</p>","blogimage":{"url":"https://cdn.traveltripper.io/site-assets/202_388_1115/media/2016-12-22-025924/Truman-Blog.jpg"}}