{
	"title": "Around the Neighborhood: Key West Historic Seaport",
	"date": "Mon Apr 10 2017 00:00:00 GMT+0530 (India Standard Time)",
	"categories": "Uncategorized",
	"url_friendly_name": "around-the-neighborhood-key-west-historic-seaport",
	"blogimage": {
		"url": "https://cdn.traveltripper.io/site-assets/202_388_2603/media/2017-04-10-064556/cuban-coffee-queen.jpg"
	},
	"Posted_by": "Admin",
	"more_content": "<p><strong>3 Reasons Why You&rsquo;ll Love hanging out at Key West Historic Seaport</strong></p>\n<p>Here&rsquo;s a quick overview of some of the must-see, do, eat and drink experiences around the neighborhood at the Historic Seaport Key West.</p>\n<p>There&rsquo;s no better place to start your day than to grab a cup of coffee right around the corner at <a href=\"http://www.cubancoffeequeen.com/\">Cuban Coffee Queen</a>. &nbsp;You can&rsquo;t miss it because it&rsquo;s what we call our live postcard from paradise where you&rsquo;ll see &ldquo;Greetings from Key West.&rdquo; &nbsp;Here&rsquo;s where you&rsquo;ll find a crowd waiting in line to grab a coffee, caf&eacute; con leche, sandwich or whatever your go to eat and drink is - walk up to the window, order and go head over to a bench at the bight and enjoy the view of the marina.</p>\n<p>&nbsp;</p>\n<p><strong>The Adventures</strong></p>\n<p><strong><img id=\"1491823020349\" class=\" \" src=\"https://cdn.traveltripper.io/site-assets/202_388_2603/media/2017-04-10-064557/marina-pic.jpg\" /></strong></p>\n<p>Now that you&rsquo;ve got your coffee, it&rsquo;s time to get out on the water and plan a morning, afternoon or full day at sea and enjoy our underwater playground: snorkel, diving, fishing, dolphin watching, kayak, sailing and more. Take time to visit with our concierge upon arrival to help plan your adventures at sea. &nbsp;You will see everything you want to do is within reach of our resort. <a href=\"https://www.themarkerkeywest.com/experiences/activities/\">View the Nearby Activities</a>.&nbsp;</p>\n<p><img id=\"1491823009461\" class=\" \" src=\"https://cdn.traveltripper.io/site-assets/202_388_2603/media/2017-04-10-064557/dinner-at-turtle-kraals.jpg\" /></p>\n<p>Photo credit: Turtlekraals.com</p>\n<p>Dining Options at the Seaport: &nbsp;If you're looking for great seafood, views and an authentic Key West experience then we&rsquo;ve got you covered. &nbsp;Here are some of our foodie favorites with dockside views and a taste of Key West: <a href=\"http://www.schoonerwharf.com/\">Schooner Wharf Bar</a>, <a href=\"http://www.halfshellrawbar.com/\">Half Shell Raw Bar</a> and Turtle Kraals, Conch Republic Seafood, Alonzo&rsquo;s, Commodore and one of the newest to the neighborhood is the <a href=\"http://www.thewaterfrontbrewery.com/\">Waterfront Brewery</a>. &nbsp; In addition we also recommend Pepe&rsquo;s, B.O.&rsquo;s Fish Wagon and Harpoon Harry&rsquo;s, all three located on Caroline Street, near the resort.</p>\n<p>Key Lime Pie! Make sure to save room for dessert and a visit to <a href=\"http://www.keylimeshop.com/\">Kermit&rsquo;s Key West Key Lime Pie Shop</a>. &nbsp;You might even see him standing out on the street waving hello and sharing his love for Key Lime Pie with you.&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>The Shopping&nbsp;</strong></p>\n<p>Local Artists and colorful shops decorate the seaside harborwalk so take your time to visit one of our unique gift shops, galleries and boutiques that offer original artwork, clothing, jewelry, trinkets and tees, fishing gear and more. &nbsp;Here are a few of our favorites: Aer Photography &amp; Art Gallery, Local Color, Dragonfly Key West, Mac&rsquo;s Sea Garden, Stingray Steve, Key West Bait &amp; Tackle. &nbsp;Happy Shopping!&nbsp;</p>\n<p>Visit <a href=\"https://www.keywesthistoricseaport.com/\">Key West Historic Seaport</a> online to learn more.&nbsp;</p>\n<p>&nbsp;</p>",
	"short_description": "Here’s a quick overview of some of the must-see, do, eat and drink experiences around the neighborhood at the Historic Seaport Key West."
	"title": "Cuba in Key West",
	"blogimage": {
		"url": "https://cdn.traveltripper.io/site-assets/202_388_1258/media/2017-04-10-025625/cuban-blog.jpg"
	},
	"url_friendly_name": "cuba-in-key-west",
	"date": "Mon Apr 10 2017 00:00:00 GMT+0530 (India Standard Time)",
	"categories": "Key West Events",
	"Posted_by": "Admin",
	"short_description": "In Key West, the influences of Cuba are everywhere; from the historic landmarks, the cigar industry, to the flavors of Havana showcased in the local cuisine. Even the acclaimed Ernest Hemingway",
	"more_content": "<p><strong>Cuba in Key West- History, Cigars, and Cuisine</strong></p>\n<p>In Key West, the influences of Cuba are everywhere; from the historic landmarks, the cigar industry, to the flavors of Havana showcased in the local cuisine. Even the acclaimed Ernest Hemingway, whose Key West residence is visited by many every year, has ties to Cuba. There is an <a href=\"http://www.hemingwaycuba.com/hemingway-house-cuba.html\">Ernest Hemingway house in Cuba</a> as well, while most notably he drew inspiration from his time on Cuban fishing boats to write the <a href=\"http://mentalfloss.com/article/64363/11-facts-about-hemingways-old-man-and-sea\">Pulitzer prize</a> winning <a href=\"https://en.wikipedia.org/wiki/The_Old_Man_and_the_Sea\">Old Man and the Sea</a>. Whether it&rsquo;s Hemingway, historic landmarks, or cuisine, Cuban influence can be found wherever you look. Dive into our top Cuban inspired must-sees of Key West below!</p>\n<p>&nbsp;</p>\n<h3><strong>Historic Locations</strong></h3>\n<p><strong>The San Carlos Institute</strong></p>\n<p>The San Carlos Institute was <a href=\"http://www.institutosancarlos.org/\">founded in 1871</a> by Cubans displaced by the war in Cuba. The historic landmark as a whole represents the pivotal independence movement for Cubans as they immigrated Key West to seek refuge. Fast-forward to present day, the San Carlos Institute is a center for education and civic purposes, serving as a &ldquo;<a href=\"http://www.institutosancarlos.org/\">museum</a>, library, art gallery, theater, and school.&rdquo; Stop by while you are in the area; their most <a href=\"http://www.institutosancarlos.org/exhibits.php\">notable exhibits</a> include Cuba&rsquo;s Pre-Philatelic Postal History, Cuba&rsquo;s Commercial Aviation History, among others!&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Cayo Huseo y Habana</strong></p>\n<p>Located in <a href=\"https://www.mallorysquare.com/\">Mallory Square</a>, a short walk from <a href=\"https://www.themarkerkeywest.com/\">The Marker Resort</a>, <a href=\"https://www.historictours.com/keywest/cayoh.php\">Cayo Huseo y Habana Historeum</a> is a great way to immerse yourself in all things Cuba. Learn about the rich <a href=\"https://www.historictours.com/keywest/cayoh.php\">Cuban Conch heritage</a>, or watch as Cuban cigars are hand rolled before your very eyes! The building in which the Cayo Huseo y Habana Historeum is housed was built in 1879, and now acts as a hub to share the rich Havana heritage that influenced the evolution of Key West&rsquo;s culture.</p>\n<p>&nbsp;</p>\n<h3><strong>Cuban Cigars</strong></h3>\n<p>The Cuban Cigar industry is one of the well known components of Key West. The industry took root in Key West due to the war in Cuba, causing Cubans to immigrate to the southernmost city. With them they brought the Havana cigar business, leading to major demand. As hand rolled cigars became a vital aspect of the local economy and culture, the Cuban&rsquo;s native language of Spanish becoming the <a href=\"/%20http:/thekeywester.com/2011/08/cigars-and-key-west/\">unofficial second language</a> of Key West. In the 1900&rsquo;s due to labor strikes, intense hurricanes, and the economic depression <a href=\"http://www.visitflorida.com/en-us/cities/key-west/cuban-heritage-in-key-west.html\">the cigar industry</a> took a hit. In recent years, cigars are still available and embody the history of Key West. The hand rolling tradition has also been handed down from one generation to the next. Stop by either the <a href=\"http://www.kwcigarfactory.com/\">Key West Cigar Factory</a> or <a href=\"http://www.rodriguezcigarskeywest.com/\">Rodriguez Cigar Factory</a> for Cuban cigars!&nbsp;</p>\n<p>&nbsp;</p>\n<h3>Cuban Cuisine</h3>\n<p><strong>Cuban Coffee</strong></p>\n<p>As we&rsquo;ve mentioned before, we are huge <a href=\"https://www.themarkerkeywest.com/blog-details/a-taste-of-cuban-coffee-in-key-west/\">Cuban coffee</a> fans. Afterall, our resort is conveniently located steps away from the beloved <a href=\"https://www.themarkerkeywest.com/blog-details/a-taste-of-cuban-coffee-in-key-west/\">Cuban Coffee Queen</a>, allowing our guests to get their caffeine fix. Some of our other favorite spots for Cuban coffee include <a href=\"http://www.kwsandyscafe.com/\">Sandy&rsquo;s Cafe</a>, an eatery so small that you may just miss it if you don&rsquo;t keep an eye out! <a href=\"https://www.themarkerkeywest.com/blog-details/a-taste-of-cuban-coffee-in-key-west/\">5 Brothers</a> is another Cuban coffee crowd favorite, one that we have even featured on <a href=\"https://www.instagram.com/p/BRTOs42Ds_I/\">our Instagram</a>! We recommend their cuban toast, it&rsquo;s a affordable and delicious treat any time of the day.&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Cuban Restaurants&nbsp;</strong></p>\n<p><a href=\"https://www.elmesondepepe.com/key-west-cuba-history/\">Cuban food</a> became largely popular during the 1860s, as Cubans brought a range of spices that were not available in most Key West. Non-Cubans and restaurants began to adapt this new flavor profile, which now is infused with most of the Key West food you find today. <a href=\"https://www.elmesondepepe.com/restaurant/\">El Meson de Pepe</a>&rsquo;s is a family owned restaurant that embraces Cuban flavors and dishes across their menu. The restaurant has been serving locals and tourists alike for over 30 years! For incredible Cuban food on a budget, look no &nbsp;further than <a href=\"http://www.elsiboneyrestaurant.com/\">El Siboney Restaurant</a> in Old Town Key West. Operating since 1984, the name &ldquo;<a href=\"http://www.elsiboneyrestaurant.com/about.html\">Siboney</a>&rdquo; comes from the town in Cuba east of Santiago de Cuba and tied to the beginning of the Cuban Revolution.&nbsp;</p>\n<p>&nbsp;</p>"
}