{"title":"Get in the Halloween Spirit at Key West's Fantasy Fest","blogimage":{"url":"/assets/images/get-in-the-halloween.jpg"},"url_friendly_name":"get-in-the-halloween-spirit-at-key-wests-fantasy-fest","date":"2016-10-21","categories":"Explorations","tags":["Explorations","Key West Events"],"Posted_by":"Admin","short_description":"Fantasy Fest is upon us! The ten days of fun themed events draws a crowd every year to get a taste of the city's energy","more_content":"<p>Fantasy Fest is upon us! The ten days of fun themed events draws a crowd every year to get a taste of the city's energy and eccentric offerings. Fantasy Fest at its inception was created to help boost tourism during the slow fall months between summer and winter. Now what used to be a down period, is one of busiest times of the season! With a new theme every year, it's easy to see why people can't get enough of Fantasy Fest in Key West! Below we've outlined some of the highlights, including our 60s rock and roll poolside party, from the festival's schedule. For the full list of Fantasy Fest events, click here!</p>\n<h4>Fantasy Fest Event Highlights</h4>\n<p><strong>10/25 TuTu Tuesday at The Waterfront Brewery</strong><br /> Break out your tutu and kick off Fantasy Fest 2016 at TuTu Tuesday next door to The Marker at The Waterfront Brewery! The event will feature 6 DJs in one night. Out-of-this-world costumes are strongly encouraged&mdash;just make sure there's a tutu! We're sure that both alien invaders, astronauts, and robots will not be in short supply.</p>\n<p><strong>10/26 The Marker's 1960s Dance Party!</strong><br /> The Marker will be hosting a rock and roll party that will take you back to the time of Tom Collins and The Beach Boys. Dust off your psychedelic duds and platform shoes--it's time to boogie the afternoon away! Dance along to the tunes of Patrick &amp; The Swayzees, who will be performing live at the event. We will be offering delectable drink specials with a 60s spin and delicious food specials at our poolside spot, Cero Bodega. Mark your calendars--this is a Marker pool party you don't want to miss!</p>\n<p><strong>10/28 The Southernmost Resort Voodoo Costume Contest</strong><br /> Get inspired by island magic and free your inhibitions at The Southernmost Resort's sea creature Voodoo costume contest! What better way to get into the Halloween spirit than with a creative costume? Make sure to enter the costume contest, we hear it gets very competitive for the top spot!</p>\n<p><strong>10/29 Fantasy Fest Parade</strong><br /> Winding through the iconic streets of Key West, the Fantasy Fest parade takes its course through the heart of Duval. From spectacular floats to dazzling costumes, the parade is truly a sight to see. Awards are given to the most memorable and creative floats at the annual event. This year's theme &ldquo;Political Voodoo Box Barbarians&rdquo; will be sure to bring out some interesting costumes &amp; floats! Get there early to get a good spot to Instagram your favorites!</p>\n<p>Make sure to have your camera or phone ready at these amazing events. Fantasy Fest offers some of the best Instagram opportunities that Key West has to offer (besides the breathtaking sunsets, of course!) We would love to see your outrageous costumes and elaborate floats, so make sure to tag us on Instagram!</p>","image":{"url":"/assets/images/get-in-the-halloween.jpg"}}