{"definition_id":"56092a983a97703d1e000001","title":"The Marker Weddings","blogimage":{"url":"/assets/images/9526/original/markerwedding.jpg"},"url_friendly_name":"the-marker-weddings","date":"2016-01-06","categories":"Explorations","tags":[],"Posted_by":"Author","short_description":"Romantic getaways in Key West are always in season, but with the arrival of this particular season come a flood of engagements.","more_content":"<p class=\"BodyA\" style=\"line-height: 16.0pt; mso-pagination: none;\">Romantic getaways in Key West are always in season, but with the arrival of this particular season come a flood of engagements. Now that the question has been popped the next step is planning your big day, and what better place than <a href=\"https://www.themarkerkeywest.com/weddings\">Key West for that picture-perfect destination wedding</a>?</p>\n<p class=\"BodyA\" style=\"line-height: 16.0pt; mso-pagination: none;\">The Marker Resort offers an array of luxury options for intimate weddings with fewer than 20 guests, to ensure your wedding will be as perfect as a Key West sunset. At <a href=\"https://www.themarkerkeywest.com/home\">The Marker Resort</a> we offer premiere lodging options ranging from our <a href=\"https://www.themarkerkeywest.com/the-marker-classic-rooms\">Marker Classic Rooms</a>, and <a href=\"https://www.themarkerkeywest.com/pool-garden-rooms\">Pool Garden Rooms</a>, to our <a class=\"\" href=\"http://www.traveltripper.io\">Key West Harbor Rooms</a>. These perfect accommodations are ideal for a mother-of-the-bride and extended family and friends.&nbsp;For the happy couple, we recommend pulling out all the stops and booking the <a class=\"\" href=\"https://www.themarkerkeywest.com/the-captains-quarters\">Captain Quarters</a>! This exquisite room offers everything from pampering amenities like signature robes, Key West Aloe bath products and a spacious soaker tub, to celebratory must-haves, like a curated in-room minibar.&nbsp;</p>\n<p class=\"BodyA\" style=\"line-height: 16.0pt; mso-pagination: none;\">As soon as you arrive in Key West for the big day, <a href=\"https://www.themarkerkeywest.com/home\">The Marker Resort</a> will take it from there, leaving you to sit back and sip a cocktail, stress-free. The rehearsal dinner is sure to impress against the beautiful backdrop of our serenity pool and vibrant tropical landscaping.</p>\n<p class=\"BodyA\" style=\"line-height: 16.0pt; mso-pagination: none;\">What&rsquo;s a wedding without a toast? Cocktail hour will follow your ceremony and be held on <a class=\"\" href=\"https://www.themarkerkeywest.com/home\">The Marker&rsquo;s</a> veranda porch. Guests will mingle and sip signature wedding margaritas, mojitos, and rum punch while sampling Ahi tuna poke, Key West pink shrimp dipped in a sweet chili sauce, or oyster Bloody Mary shooters. You could also choose some of our hot hors d&rsquo;oeuvres options ranging from conch fritters with key lime mustard and tenderloin sugarcane lollipops to coconut shrimp with pineapple dipping sauce. With all these tasty options, it&rsquo;s easy to see that the tantalizing flavors of Key West play a big role in our menu!&nbsp;</p>\n<p class=\"BodyA\" style=\"line-height: 16pt;\">Post cocktail hour the wedding party will be lead into our newly built Harbor House, set aglow with twinkling candles atop every table. Dinner features two entrees of your choice from our extensive list of offerings. Some Marker favorites include chicken stuffed with&nbsp;prosciutto, goat cheese, spinach, and roasted red pepper or seared scallops in a key lime beurre blanc. The couple may prefer to choose from our station dinner or buffet option, but enough about dinner- what&rsquo;s a wedding without cake? You&rsquo;ll have a tasty choice between The Marker Resort&rsquo;s signature wedding cake, or other delicious dessert options.</p>\n<p class=\"BodyA\" style=\"line-height: 16pt;\">After the wedding, we hope that newlyweds will stay and enjoy all that Key West has to offer. We suggest setting sail to the <a href=\"https://www.drytortugas.com/\">Dry Tortugas</a>, or a visit <a href=\"http://www.hemingwayhome.com/\">the Ernest Hemmingway home</a>. We&rsquo;ll call it a pre-honeymoon honeymoon, but keep in mind that <a href=\"http://www.traveltripper.io\">Key West honeymoons</a> are some of the best around. Once you&rsquo;ve experienced a wedding at The Marker Resort, you&rsquo;ll understand why people can&rsquo;t help but feel the <a class=\"\" href=\"https://www.themarkerkeywest.com/romance\">love in Key West</a>! Speaking of feeling the love, we want to offer our newly-engaged readers something very special: <strong>If you book your 2016 wedding at The Marker Resort before January 31, 2016, you&rsquo;ll receive 16% off your food and beverage! Be sure to mention our blog post to receive this special offer</strong>. Just another great reason to celebrate your big day with us.</p>\n<p class=\"BodyA\" style=\"line-height: 16pt;\">&nbsp;</p>","blogimage_id":"9526","_delete_blogimage":"0","definition":""}